{"results": [{"data": {"petition": {"id": "8655098", "slug": "kate-quinn-support-jk-rowling-s-fantastic-beasts-sequel-remove-ugly-slur-against-johnny-depp", "user": {"id": "2057692", "displayName": "Kate Quinn", "photo": {"id": "155001605", "userSmall": {"url": "//assets.change.org/photos/3/md/gg/TwMDGgLTncJhLaN-48x48-noPad.jpg?1529953135", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "18377456", "createdAt": "2016-11-06T19:09:56.000Z", "title": "305 Supporters!  This is amazing!  Let's keep this going! :D", "description": "I am reaching out to the Human Rights Campaign and UCLA about this, as well as President Obama.  I also included Johnny and Lily Rose, as well as JK Rowling.  Let's shoot for as many signatures as we can get, so that perhaps some of these higher ups speak out about how VERY complex all kinds of abuse is, and how innocent, however accused people need to have the \"Scarlet Letter\" taken off their foreheads.  By the way, Johnny Depp--you're looking AMAZING, love!  Thanks for all you do, and you EARNED that award for Rhonda's Kiss!  :)  Keep that Love Alive.", "photo": {"id": "155189744", "petitionMedium": {"url": "//assets.change.org/photos/1/yq/ck/GnyQcKntGiQXNQd-800x450-noPad.jpg?1530537060", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "18373454", "createdAt": "2016-11-06T10:18:02.000Z", "title": "260 Supporters!  Thank you all!  Let's Keep Spreading the Word Until the Movie Comes Out", "description": "Johnny Depp has some seriously awesome supporters, who KNOW how to discern truth from lies.  As a man who is incapable of being anything but HONEST and REAL, he certainly attracts people who see beyond the surface like he does.  Thank you all so much! :)", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "18372455", "createdAt": "2016-11-06T07:14:35.000Z", "signatureCount": 250}, {"__typename": "MilestonePetitionUpdate", "id": "18371060", "createdAt": "2016-11-06T00:31:46.000Z", "signatureCount": 200}, {"__typename": "StarterPetitionUpdate", "id": "18368786", "createdAt": "2016-11-05T18:50:08.000Z", "title": "128 People Supported Fantastic Beasts and Johnny Depp!  Now, I'm Going to Go for MORE Signatures", "description": "In twenty-four hours, I've reached my goal of getting 128 people to sign my petition, Support JK Rowling's Fantastic Beasts--Remove Ugly Slur on Johnny Depp!   However, wonderful as that accomplishment is, we need a lot more supporters to gain even better leverage on this very real issue. Johnny Depp was accused of something he did not do. He may not have done any prison time, but he may as well be a prisoner of the label inflicted upon him. \"Domestic Abuser,\" is what blindsided Harry Potter fans on Twitter are calling him.  Those outraged by the idea of Johnny Depp having anything to do with Harry Potter, a story that promotes anti-bullying and awareness of domestic violence towards children, etc...they NEED to know that this man is INNOCENT. Johnny  Depp knew, like so many others, that the West Memphis Three were innocent. He campaigned passionately for them along with Patti Smith, Eddie Vedder and others.  However, even after all was said and done, the Three were released from prison, ONLY if they pleaded guilty to murders they never committed!  Now, they will wear that stigma on their characters for years, unless they can somehow re-open the case and prove themselves innocent.  Johnny Depp had to have gone through intense agony this past summer, although he hid it well with a brave face.  It may not be desirable to him to re-open the case and prove Amber Heard a liar...although he was prepared with 23 witnesses for the upcoming trial in August.  However?  Amber Heard is a master at what she set out to do to him. She, having lived with and known him for four years, knew how to push  Johnny Depp's buttons.  It was malicious.  Once Amber learned of all the ammunition  Johnny had gathered for his defense, she wasted no time putting out that video of Johnny cursing and banging around inanimate objects while drunk. She denied putting the video out, but that was just a cover up.  No one who saw that video didn't cringe when they saw Johnny Depp really angry, and not in character.  They took that video and assumed the worst. However, the camera filming the video was BEHIND  Amber Heard, not held in her hand.  Why else would we see her?  What we hear at the end of the video which may sound like a scuffle and perhaps  Amber being thrown to the floor--is actually Johnny ripping the hidden camera out of the wall. What else would it be?  He gestures to Amber's hand holding the remote to the camera.  But he did not grab the remote. He went right for the camera.\n\nThe final straw for Depp was the picture of the severed finger, and the message he \"supposedly\" wrote on a mirror that indicated Amber Heard had been unfaithful to Johnny with Billy Bob Thornton.  \n\nNOBODY took into consideration that despite  Johnny's dipping his gushing finger in paint...that mirror would be spattered with blood and the message would never have been legible.  Why didn't anyone consider that? \n\nThe horrific anguish which I have been through myself, that women have suffered in domestically violent relationships with men caused emotions to run high when Depp was accused.  Emotions alone and not sense ruled those supporting Amber in the social media trial.  As emotional as I got, however,I also made sure to look carefully at all the clear evidence on both sides.  Once I learned what was really going on, I went to town on social media.\n\nBut we will not bring Johnny Depp peace by fighting and mud-slinging with each other. We need to show support and promote awareness of Domestic Violence against ALL humans.  We need to NOT lessen the importance of stopping REAL Abuse Against Women--but we can't forget that all men are not perpetrators and misogynists.  Johnny Depp isn't just one more \"white male celebrity who can get away with hitting his wife and still work.\"  This is not about that.  Johnny Depp is INNOCENT.  Mel Gibson and other male celebrities who were proven guilty are having trouble getting back to work. Johnny Depp is INNOCENT.   We can't allow him to be lumped in with those who actually DID hurt their girlfriends/wives.\n\nLet's stand strong against violence,  lies, bullying and ALL forms of abuse!  Let's remember that all celebrities are not conceited misogynists who don't care about anybody but themselves. Johnny Depp has always been real, upfront and has always spoken his Truth. Everyone who meets him or watches an interview with him knows how GENUINELY kind and good he truly is. It's not an act. No one who works with Johnny doesn't know that, no one who loves him doesn't know that.\n\nStereotypes, Blindsidedness, bias towards ONE gender who gets domestically violated, stops here.\n\nI will keep going until I get a million signatures if I can. :)\n\nThank you ALL for your wonderful support!!!", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "18367811", "createdAt": "2016-11-05T16:39:56.000Z", "signatureCount": 100}, {"__typename": "MilestonePetitionUpdate", "id": "18367784", "createdAt": "2016-11-05T16:36:29.000Z", "signatureCount": 100}, {"__typename": "MilestonePetitionUpdate", "id": "18365396", "createdAt": "2016-11-05T11:36:36.000Z", "signatureCount": 50}, {"__typename": "MilestonePetitionUpdate", "id": "18363521", "createdAt": "2016-11-05T04:24:00.000Z", "signatureCount": 25}, {"__typename": "MilestonePetitionUpdate", "id": "18363152", "createdAt": "2016-11-05T02:45:24.000Z", "signatureCount": 10}, {"__typename": "MilestonePetitionUpdate", "id": "18362897", "createdAt": "2016-11-05T01:42:12.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjEw", "hasNextPage": false}}}}}], "count": 1, "cursors": [""]}