{"results": [{"data": {"petition": {"id": "11478629", "slug": "metallica-metallica-to-play-the-entire-st-anger-album-live-for-its-20-year-anniversary", "user": {"id": "241739201", "displayName": "Gregory Montenegro", "photo": {"id": "192256534", "userSmall": {"url": "//assets.change.org/photos/4/aw/uf/swAwufxsXUyTCVM-48x48-noPad.jpg?1509726238", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "30949280", "createdAt": "2022-09-25T20:46:29.000Z", "title": "St. Anger gets booed and James doesn't like it", "description": "<p><a href=\"https://youtu.be/RCpZNf5ZewI\" rel=\"nofollow\">https://youtu.be/RCpZNf5ZewI</a></p>\n<p><a href=\"https://youtu.be/t39aoCtsyOs\" rel=\"nofollow\">https://youtu.be/t39aoCtsyOs</a></p>\n<p>A little late to find this, but James Hetfield was frustrated how St Anger is underappreciated and was even booed! Mr. Hetfield, you have not seen our petition? I know it's still short of a thousand votes, but surely you have searched up if there is any corner of the internet that appreciates this album? Notice us, James Hetfield! We are not gone! We are still here support St. Anger full on!</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "30719387", "createdAt": "2022-07-04T09:19:51.000Z", "signatureCount": 750}, {"__typename": "StarterPetitionUpdate", "id": "30133891", "createdAt": "2022-01-29T04:10:07.000Z", "title": "Been a while", "description": "<p>Hello everyone, it has been a while. Yes, this petition is still active and I'm still promoting it where I can. I hope everyone is doing well and safe in these troubling times. I have a couple of updates. Metallica did recently play Fixxxer for the first time ever on the 40th anniversary. I am happy for that. But they still left anything from St Anger in the dark. They still play St anger itself and Frantic every now and then, but nothing else. We haven't seen the situation change in some years now. At the time we hit a couple hundred signatures, I did email Metallica where I could that we had some momentum going around. At the time of this update, I see we reached over 700, which is great! But sadly I guess for someone as big as Metallica, it needs to be a lot more for them to even bat an eye. I have faith in you all to share the petition around as much as you can. Not really donate money, but share the link around. I'd prefer that. Whatever you can do. This album needs the appreciation it deserves. I feel as Metallica lets us down with caving to popular demand still playing the overplayed songs. From the 80s and early 90s. Nothing much from Load/Reload and St. Anger. Our focus is St. Anger, but Load/Reload still do deserve some recognition as well. Thank you if you read this, and hope you all stay in good health!</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27540852", "createdAt": "2020-08-17T22:52:38.000Z", "title": "Hello again", "description": "<p>Hey everyone, I changed the title to \"20 year anniversary\" since we are well over 2 years past the 15th anniversary. At this rate, yeah let's go for 20 year anniversary! Metallica keeps playing All Within My Hands as the acoustic version. Considering he was in rehab, I'm quite surprised he doesn't want to vent that anger into it. He definitely should! It worked 17 years ago, it can work now.</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "26699399", "createdAt": "2020-05-22T05:22:07.000Z", "title": "Not Dead", "description": "<p>This petition is not dead, I just haven't updated due to personal problems. Things that only make me relate to this album even more. Makes me angrier and yet... Calmer. This album never ceases to be the emotional venting therapy it is. Let's keep it going everyone, do not stop.</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "25116744", "createdAt": "2019-09-25T19:14:17.000Z", "title": "We still have a mission", "description": "<p>Hello everyone, sorry for a long inactivity. Let me update you on one thing that happened in that time gap: I attended the AWMH food bank volunteering thing back in May. I'm very late to mention this, but I went with a St. Anger shirt knowing they will take a picture and send it to Metallica. I can post the picture in another update, but for now just know I did my best there to show to Metallica there IS love for the album. They probably didn't even see it though, there were so many places and volunteers. I made sure my shirt was visible though. It was very fun to attend it, I'd do it again.</p>\n<p>Now as for our mission here, we still have it. Recently Metallica has launched their tour of Symphony and Metallica 2 (S&amp;M 2) and they seem to be a bit busy with it at the moment, but that doesn't invalidate our mission. They are still going to tour in South America, we still have our chance. The reason we still have our mission, is because Metallica does not move from St. Anger (the song), Frantic, and the acoustic All Within My Hands. They still play those 3 songs on and off, nothing else from the album. Now, yes this is better than not having any songs from St Anger be played live, but I believe Metallica still does not understand we have a large hunger for the rest of the album. It still needs more love. They are missing on potentially amazing live plays to hype up the crowd. Come on, how many times have they played Enter Sandman, Battery, etc? People already know those songs. Time for a new mixup! Sweet Amber, Some Kind of Monster, Invisible Kid, Purify, the actual metal All Within My Hands, Dirty Window, The Unnamed Feeling, My World, and Shoot Me Again!!! Where are they, Metallica?? Again, it's up to us fans to let them hear our voice. We have to do the work, we have to make sure they will hear us. And never give up. Post on Instagram your shirt of St Anger, or just an image of St Anger from google or something to show it's St Anger, and tag Metallica on it with the link to this petition. We can do this guys! Don't give up!</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24508116", "createdAt": "2019-05-04T02:28:04.000Z", "title": "This keeps getting better", "description": "<p>Metallica just played the self-titled \"St. Anger\" earlier today on May 3rd, 2019 in Madrid, Spain. This is crazy... Either we are finally getting somewhere with our petition, or just by coincidence they chose to play these songs!!! :D</p>\n<p>It might likely be the latter, but makes me really think it might just be from our efforts that maybe reminded or inspired them to play it. </p>\n<p>Keep the ball rolling guys, we are doing good!</p>\n<p>I have made a Discord for us. You are all welcome to join.</p>\n<p>Link here: <a href=\"https://discord.gg/8VreEHn\" rel=\"nofollow\">https://discord.gg/8VreEHn</a></p>\n<p>8VreEHn in case you can't click the link or want to invite others.</p>\n<p>Video below is the live performance of St. Anger in Madrid!</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24503901", "createdAt": "2019-05-03T03:35:48.000Z", "title": "Everyone, kind of big news here!!!", "description": "<p>Metallica yesterday in Lisbon, Portugal just played Frantic!!! Along side other songs that are rarely played or was never played until then! (Lords of Summer is one) That's incredible. I knew James is growing that hair and mustache for a reason! Let's keep the ball rolling guys! Let's make this summer rock!!!!</p>\n<p>Down below is the link to someone that recorded their play of Frantic in Lisbon! Kudos to him.</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24129593", "createdAt": "2019-02-06T04:13:24.000Z", "title": "A couple of updates.", "description": "<p>Yes, this petition is still going and active. A couple of things I want to mention. Metallica played All Within My Hands but in an acoustic version in November last year, just like they did in 2007. Although I was happy they played a St. Anger song again, it was of course, not the metal original version. I personally appreciate that though that it was played at all.</p>\n<p>Now that we're there, James Hetfield has started to grow out his St. Anger days look. Longer hair and that biker mustache. Rocking it like before! :D And the rest of the band with longer hair too, quite like how they started touring after getting Robert Trujillo. Here's hoping they at least play one song as it was in the album. Ergo, metal. It really is shocking me that they haven't played a St Anger song at this point. It makes this petition more valid but it really is shocking. What's going on that they don't play the songs anymore? I mean I know I stated the possible reasons in the petition, but they had to have at least played one once in this tour. They still haven't yet. But again, here's hoping they do, if not, we at least should hope this petition is noticed by Metallica somehow.</p>\n<p>That is all for now, thank you for taking your time to read this if you did, and rock on! Good day to you all.</p>\n<p>Linking the video of the November 2018 performance of All Within My Hands.</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "23475609", "createdAt": "2018-10-25T03:07:05.000Z", "title": "Woah", "description": "<p>That was a big boom in support and signatures! Keeping it alive! Oh yeah! :D<br>Remember to spread it out as much as possible! Metallica's Instagram, Facebook, YouTube videos, etc.! Rock on!!! We are getting there little by little! In this case, big steps! :D</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "23434165", "createdAt": "2018-10-17T15:10:14.000Z", "signatureCount": 500}, {"__typename": "StarterPetitionUpdate", "id": "23218085", "createdAt": "2018-09-03T05:39:27.000Z", "title": "Spreading this", "description": "<p>Hi everyone, it's me again. Everyone, if we want this petition to reach Metallica, we have to absolutely send this, spread this, to any and every form of social media/emails that belong to Metallica. We have to constantly do this, not in an annoying way from one person, but sending to as many contacts/accounts/pages that belong to Metallica as possible. One of each of those 3 types of contacts I listed. We have to do it a lot and to many pages for them to notice that pattern. I have already sent this to Metallica's main email and their All Within My Hands Foundation (funny name, it's a St. Anger song), and if it's just one person that sends it, they'll disregard it as like a troll or something. We have to do this as a collective group. I'll link the emails down below, and you guys go ahead and send them the link to this petition. You may leave a message if you want, but keep it brief and simple:<br>info@allwithinmyhands.org (if email doesn't work/no reply, try once more on their Contact Us page)<br>and<br>info@metclub.com<br>Also, all their official pages like on Instagram, Facebook, YouTube, etc. Find them and post/tag them with this petition. Come on, we can do this! :D<br>If it's a constant amount of people that send them this specific link, they for sure will notice and see it! :D</p>", "photo": null, "video": null, "embeddedMedia": null}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjEx", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "11478629", "slug": "metallica-metallica-to-play-the-entire-st-anger-album-live-for-its-20-year-anniversary", "user": {"id": "241739201", "displayName": "Gregory Montenegro", "photo": {"id": "192256534", "userSmall": {"url": "//assets.change.org/photos/4/aw/uf/swAwufxsXUyTCVM-48x48-noPad.jpg?1509726238", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "22860808", "createdAt": "2018-06-10T06:53:03.000Z", "title": "15 years", "description": "I'm a bit late to it, but 15 years ago on June 5th, 2003, the mighty album St. Anger was released. Life changing event for Metallica and us fans.\nNow, for those that think that this petition had the deadline on June 5th, it's not over. In the end of the petition, I do say that it doesn't necessarily have to be for their 15 year anniversary. It's just a date. What matters, is St. Anger gets the love it deserves, and the understanding of it. Some hate it due to not understanding its tone, its fury. Or just plain don't like it. The dream still lives on.", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "22751092", "createdAt": "2018-05-15T18:48:33.000Z", "title": "400!", "description": "We have well over 400 at this point! Amazing amount of support! Let's keep this going! :D", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "22349580", "createdAt": "2018-02-07T06:37:18.000Z", "title": "Over 300!!!", "description": "WOOAAH\nI gotta pull another drawing out for this.\nLet's keep this rolling everyone! O:&lt;\nHOORAH\nLet's give St. Anger the respect he deserves, and disprove that he never gets respect. Let's GO!!!!", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "22333986", "createdAt": "2018-02-03T15:00:35.000Z", "signatureCount": 250}, {"__typename": "StarterPetitionUpdate", "id": "22309323", "createdAt": "2018-01-28T22:30:08.000Z", "title": "Over 200 already!", "description": "Wow! That was quick! o_o\nWe're doing good! :D\n\n\nJust did a quick drawing with my reaction XD", "photo": {"id": "216341342", "petitionMedium": {"url": "//assets.change.org/photos/6/rf/qg/vlrfqGBxbUoxmLo-800x450-noPad.jpg?1517178617", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "22305831", "createdAt": "2018-01-28T00:46:56.000Z", "signatureCount": 200}, {"__typename": "MilestonePetitionUpdate", "id": "22304512", "createdAt": "2018-01-27T17:17:33.000Z", "signatureCount": 200}, {"__typename": "StarterPetitionUpdate", "id": "22295970", "createdAt": "2018-01-25T16:12:01.000Z", "title": "Over 100 supporters", "description": "Wow! O:\nThat's incredible! At this moment writing it, it spiked! Everyone, great job! We are doing this right! :D\nI sent an email to Metclub and posted in a St. Anger forum in Metallica's website this petition to spread it to more fans! In hopes this will reach many more people and have Metallica notice us! :D\nI would say thanks for supporting, but this is for every one of us, this is from us to Metallica! This is for Metallica, for St. Anger! :D\nLet's keep spreading it! Post in forums, post in Metallica videos, post them all you can where St. Anger is related to where you're posting! Let's keep this going! :D", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "22288313", "createdAt": "2018-01-24T02:13:13.000Z", "signatureCount": 100}, {"__typename": "StarterPetitionUpdate", "id": "22287975", "createdAt": "2018-01-24T00:09:00.000Z", "title": "Almost at 100", "description": "Everyone we are almost at 100! Incredible!!! :D\nI will send this petition to the Metclub email address at 100 to show them we are getting somewhere. No, it will not be done at 100, we are definitely going to need more signatures for Metallica to see a good portion of their fans want this to happen. We need to put all our support into this! I am hoping the Metclub staff can see we are getting somewhere, and probably can do an announcement or something of the sort for fans to go sign it to a certain number for Metallica themselves to see the support for St. Anger, and see what they decide to do. This is exciting, guys! :D", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "22097349", "createdAt": "2017-12-04T21:48:17.000Z", "title": "50 Supporters", "description": "We are at 50 everyone! :D\nEveryone that reads this, post it on every St. Anger video (any song from St. Anger) to spread the word. Especially on Official Metallica channel videos, so there's a chance for them to see it. We can do this y'all! :D", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "22093453", "createdAt": "2017-12-03T21:52:24.000Z", "signatureCount": 50}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjIz", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "11478629", "slug": "metallica-metallica-to-play-the-entire-st-anger-album-live-for-its-20-year-anniversary", "user": {"id": "241739201", "displayName": "Gregory Montenegro", "photo": {"id": "192256534", "userSmall": {"url": "//assets.change.org/photos/4/aw/uf/swAwufxsXUyTCVM-48x48-noPad.jpg?1509726238", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "21571171", "createdAt": "2017-10-04T09:33:17.000Z", "signatureCount": 25}, {"__typename": "StarterPetitionUpdate", "id": "21341608", "createdAt": "2017-09-13T22:52:59.000Z", "title": "20 supporters!", "description": "Oh my God! We're getting there, my friends! :D\nThank you all! :3 Well, this is for us all! :D", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "20931343", "createdAt": "2017-07-30T02:11:37.000Z", "signatureCount": 10}, {"__typename": "MilestonePetitionUpdate", "id": "20724856", "createdAt": "2017-07-03T17:40:57.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjI3", "hasNextPage": false}}}}}], "count": 3, "cursors": ["", "YXJyYXljb25uZWN0aW9uOjEx", "YXJyYXljb25uZWN0aW9uOjIz"]}