{"results": [{"data": {"petition": {"id": "22932602", "slug": "laguna-beach-city-council-and-planning-commission-stop-the-hydrogen-fueling-tanks-compressor-and-piping-at-broadway-pch-mobil", "user": {"id": "75494882", "displayName": "Amber Edwards", "photo": {"id": "198719227", "userSmall": {"url": "//assets.change.org/photos/3/vz/zd/RevzZdanKeDCTik-48x48-noPad.jpg?1587003161", "processing": false}}}, "organization": {"id": "3084102", "name": "Laguna Beach residents", "photo": null}, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "30755309", "createdAt": "2022-07-16T23:35:14.000Z", "signatureCount": 200}, {"__typename": "StarterPetitionUpdate", "id": "27401986", "createdAt": "2020-07-28T19:15:45.000Z", "title": "Update on Hydrogen Fuel proposal and help needed!", "description": "<p>First, I apologize for the silence and lack of updates as we have been in a holding pattern, waiting for the development company to submit their revised plans for the Mobil station hydrogen fuel pumps. Because of the delay and concerns, this topic has been removed from the Planning Commission's agenda until a later date, we are assuming September. This week, the revised proposal was submitted and is currently being reviewed by Laguna Beach Fire Marshall, James Brown.</p>\n<p>The new proposal is extremely concerning, specifically in regards to distances from structures, cars and pedestrians. The proposal acknowledges they are not meeting separation requirements - \"It is still our intention to comply with the NFPA 2 required setbacks wherever possible. However, due to site constraints, there are a few separation distances that we are unable to meet...\"    They are proposing that their enclosure safety precautions negate the need for the separation requirements. Note there are 7 areas where they are below distance required, and 2 of those, near parked cars, require 25 feet separation and their proposal is only 4 feet!   As an extremely congested area, right next to Main Beach, this is NOT a place to take a chance.</p>\n<p>We need your help! Please send this petition to every LAGUNA Resident you know (we need to show City Council it's the locals who are concerned). And email Evan Jedynak directly (from the Planning Commission) - EJedynak@lagunabeachcity.net.</p>\n<p>Thank you!</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27108050", "createdAt": "2020-06-25T20:30:14.000Z", "title": "Update on Hydrogen Fuel Pumps at PCH and Broadway", "description": "<p>First, I want to thank you all for signing the petition to STOP the expansion of the Mobil station across from Main Beach from adding hydrogen fuel pumps in the most congested area in all of Laguna... this is a major safety issue, the current plans do not indicate any hazard assessment has been completed, and we know they are currently not within California codes.  I do not want to bombard your inboxes, so my plan is to send an update just once a week unless urgent.</p>\n<p>Here's the latest:  The Planning Commission and the Laguna Beach Fire Marshall have requested more detailed plans from the developer, and as a result the hearing has been pushed back to July 15th. We don't expect the new plans until only a week before that, not leaving much time for proper review.   We have also engaged a 3rd party subject matter expert to do a thorough independent assessment so that we are all more informed with specifics and facts.  We will plan to have him testify at the hearing, and we need as many people as possible to participate to have our voices heard.</p>\n<p>Here's what you can do in the meantime:</p>\n<p>- Send this petition to every Laguna Beach resident you know! I want 500 signatures!</p>\n<p>- Email your concerns - nothing better than a heartfelt email sharing your safety concerns about possible explosions in a very crowded area, the impact on our property values, the obstructed views. But safety is the single biggest issue.   Email Evan Jedynak, city planner at ejedynak@lagunabeachcity.net; Scott Drapkin, planning commission staff liaison at sdrapkin@lagunabeachcity.net; and City Council at cityclerk@lagunabeachcity.net.</p>\n<p>Thank you!</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "27067069", "createdAt": "2020-06-21T23:30:54.000Z", "signatureCount": 100}, {"__typename": "MilestonePetitionUpdate", "id": "27056597", "createdAt": "2020-06-20T17:59:31.000Z", "signatureCount": 50}, {"__typename": "MilestonePetitionUpdate", "id": "27047350", "createdAt": "2020-06-19T19:42:57.000Z", "signatureCount": 25}, {"__typename": "MilestonePetitionUpdate", "id": "27039200", "createdAt": "2020-06-19T02:35:18.000Z", "signatureCount": 10}, {"__typename": "MilestonePetitionUpdate", "id": "27037272", "createdAt": "2020-06-18T22:46:39.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjc=", "hasNextPage": false}}}}}], "count": 1, "cursors": [""]}