{"results": [{"data": {"petition": {"id": "13169665", "slug": "what-s-in-your-backyard", "user": {"id": "874303628", "displayName": "Amber Hoverson", "photo": {"id": "220576474", "userSmall": {"url": "//assets.change.org/photos/8/ac/uz/ThaCUZyRbcHqRAZ-48x48-noPad.jpg?1525650284", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "22875293", "createdAt": "2018-06-13T13:52:17.000Z", "title": "City Council Meeting Tomorrow", "description": "If you can make it to the City Council Meeting this Thursday at City Hall we would love your support!  We are wearing red shirts and meeting around 5:15p.  We will sit together to show unity.  You can also show support by sending an email message to bdeese@cityofpensacola.com expressing your thoughts on why Old East Hill would be better off without the proposed code change.  An email can also be sent even if you do plan to attend.  Thank you again to everyone!", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "22790737", "createdAt": "2018-05-25T22:06:24.000Z", "signatureCount": 250}, {"__typename": "StarterPetitionUpdate", "id": "22786619", "createdAt": "2018-05-24T21:19:32.000Z", "title": "NO OUTSIDE AREAS", "description": "To date, we have yet to find one single county, city, or historic district which would allow any business like this to operate in C-1 zoning with outside exercise areas of any kind. Standard language across the board says all uses must remain in soundproof buildings with no outside areas allowed. If the animal hospital or pet boarding facility has outside exercise areas, they are required by law to be in C-3 (heavy commercial where some outside noise and minor fumes associated with the business are allowed or in Industrial Zoning. I've checked Gulf Breeze, Santa Rosa County, Escambia County, Mobile, Fairhope, and other historic cities such as Savannah, St. Augustine, New Orleans. It looks very much like across the country, it's a standard rule of where you put these types of businesses.   We have even heard from other vet clinics in the city that there is no reason that a clinic or boarding facility needs to have outdoor areas.  \nThank you for everyone who has helped research all the information on this project!", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "22758979", "createdAt": "2018-05-17T16:56:28.000Z", "title": "Negative reactions from clients of East Hill Animal Hospital", "description": "Hello wonderful supporters,\nA petition in opposition of our petition has been created recently.  This petition is pretty negative in the fact that it states \n“Although the legalities of the situation will not be presented here, we want Dr. Hall to know that many of us are opposed to the harassment that is being given to Dr. Hall by some residents and a particular Preservation District in the same area”\nWe have never harassed Dr. Hall or her businesses and feel that this is an undeserved portrayal of our group of people who believe a code change would be harmful to our neighborhood.  We have done our absolute best to be fact based and composed when discussing this issue.  Please share our petition if you haven’t already.  I am also collecting letters to pass on to City Council so if you feel strongly please send me your letters at amber.hoverson@oldeasthill.com.  Thank you all so much!    \n\nAmber", "photo": {"id": "220618864", "petitionMedium": {"url": "//assets.change.org/photos/0/zx/gc/HDZXgCSTZmYSZcr-800x450-noPad.jpg?1526576190", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "22741534", "createdAt": "2018-05-13T03:09:02.000Z", "signatureCount": 200}, {"__typename": "StarterPetitionUpdate", "id": "22724953", "createdAt": "2018-05-08T17:46:04.000Z", "title": "City Council Meeting June 14", "description": "Hi everyone and thank you so much for supporting our cause!  \nThis issue will not be going before the City Council this Thursday; the agenda item has been moved until June 14th.  We are excited about this because it gives us more time to gather additional support.  We appreciate all your shares and comments.  We are also collecting donations for our \"lawyer fund\" and if anyone would like to make a donation anything is appreciated.  At our website oldeasthill.com just click on the \"donate\" button.  \nWe've also streamlined the content of the original petition and would love to hear your thoughts when you have time.  (this version is less lengthy)  \nThanks again!  \nAmber Hoverson", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "22720483", "createdAt": "2018-05-07T15:53:26.000Z", "signatureCount": 100}, {"__typename": "MilestonePetitionUpdate", "id": "22716908", "createdAt": "2018-05-06T14:47:43.000Z", "signatureCount": 50}, {"__typename": "MilestonePetitionUpdate", "id": "22715511", "createdAt": "2018-05-06T02:18:13.000Z", "signatureCount": 25}, {"__typename": "MilestonePetitionUpdate", "id": "22715313", "createdAt": "2018-05-06T00:02:40.000Z", "signatureCount": 10}, {"__typename": "MilestonePetitionUpdate", "id": "22715216", "createdAt": "2018-05-05T22:59:22.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjEw", "hasNextPage": false}}}}}], "count": 1, "cursors": [""]}