{"results": [{"data": {"petition": {"id": "11302544", "slug": "gary-herbert-abuse-w-o-punishment-at-central-davis-jr-high-teen-boys-abuser-vs-teen-girls-victims", "user": {"id": "721795040", "displayName": "Amber Sees", "photo": {"id": "176074640", "userSmall": {"url": "//assets.change.org/photos/5/yh/hz/HgyHHzCJaDaYyiR-48x48-noPad.jpg?1494986857", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "20365211", "createdAt": "2017-05-25T03:27:25.000Z", "title": "Victory!", "description": "Davis county and Utah took action, my petition was acknowledge, Thank you to all my supporters we as well as are children were heard! Suicide prevention program will now be acknowledged. Thank you thank you! Happy tears!", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "20329682", "createdAt": "2017-05-20T23:59:34.000Z", "signatureCount": 25}, {"__typename": "StarterPetitionUpdate", "id": "20326385", "createdAt": "2017-05-20T13:34:45.000Z", "title": "Davis county open your eyes", "description": "I feel that there are so many opportunities to get students, parents and school staff training to help overcome this self harm and suicide problem.  If kids want to bully their peers, I feel they need to get locked up with a bigger bully in the prison for at least an hour per student they abuse. And have a 3 strikes your out on bad behavior that affects other students. What's the point of depriving the victim of their education, if it's proven that bullies don't make it through life outside of prison walls, put them in job Corp. They will then get an education but will have to earn there privileges, not just get handed them. They have security and plenty of staff to be on the ball with these troubled teens, and it'll give them a second chance to change their direction in life.", "photo": {"id": "176437007", "petitionMedium": {"url": "//assets.change.org/photos/9/fp/mv/kRfPmVmYpYOJSId-800x450-noPad.jpg?1495287287", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "20312354", "createdAt": "2017-05-18T22:15:00.000Z", "title": "CDJH has a terrifying past that still continues", "description": "Terrifying knowing CDJH  has students from 2012- 2015 thanking me for speaking out on behalf of the abused students. The student will remain anonymous, but here is their story.\n\n\"Dear Loretta,\nI have no other way to say thank you by saying thank you (go figure)\nYour petition, which I have signed, has also allowed me to speak out about the abuse myself and old friends have gone through from 2012-2015. I figured I would share the abuse that happened then as well in high hopes it'll help your case. \nWhen i was going through some hard times bullying picked up a lot more. I was called names such as bitch, cunt, whore, slut, ugly and many more. When I would try and report these bullying cases, non of them were fixed or I was told to ignore the people doing so. I had one male try to fight me my 9th grade year IN FRONT OF THE OFFICE WINDOWS outside and they did nothing. I am hypoglycemic and the lunch ladies would run out of food very often. It got so bad that I almost passed out in one of my cases and even my mother complained and they still did nothing. I had many anxiety attacks and nothing was done to help such and even the principle (who left my 9th grade year) didn't help and I was surprised that it even got up to him. I had many trans friends and they did nothing to protect them from all the bullying the endured. I would self harm and was told to commit suicide and they had the same thing happen. \nBy my last year there I was numb and depressed and my only vice was Choir and Theater (Mr. Campbell's classes). I still have memories that haunt me and I have night terrors from them all. \nAnyways I hope this all helps you.\"\n\n\nThis has been an ongoing problem for to Long, this could be your child one day, or already is and afraid to speak about it! Davis county, Central Davis Jr. High staff, and parents don't be blind to this situation, fix it!", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "20298680", "createdAt": "2017-05-17T16:19:16.000Z", "signatureCount": 10}, {"__typename": "StarterPetitionUpdate", "id": "20293442", "createdAt": "2017-05-17T03:23:48.000Z", "title": "CDJH and Davis school district are taking action", "description": "My daughter came home after her concert and informed me that action is being taken, I am so happy to hear that or daughter's voices are being heard. I will update on what action was taken on the bullies. Thank you all, it's the one that speaks the loudest that gives children and teens that second chance", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "20293316", "createdAt": "2017-05-17T02:53:50.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjY=", "hasNextPage": false}}}}}], "count": 1, "cursors": [""]}