{"results": [{"data": {"petition": {"id": "14986339", "slug": "warner-brothers-save-johnny-depp-as-gellert-grindelwald-in-the-movie-fantastic-beasts", "user": {"id": "39067970", "displayName": "Илона Сотмари-Реваи", "photo": {"id": "221982079", "userSmall": {"url": "//assets.change.org/photos/2/ua/fs/tLuAFsJOWEDOmpG-48x48-noPad.jpg?1555590275", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "28025510", "createdAt": "2020-11-07T10:42:07.000Z", "title": "Petitions in support of Johnny", "description": "<p>Friends, yesterday there were several petitions that I ask you to sign:<br>For the dismissal of judge Nicole, who handed down an unfair decision</p>\n<p><a href=\"https://www.change.org/p/britain-justice-nicol-needs-to-be-fired-justice-for-male-da-survivors\" rel=\"nofollow\">https://www.change.org/p/britain-justice-nicol-needs-to-be-fired-justice-for-male-da-survivors</a></p>\n<p>To keep Johnny as Grindelwald</p>\n<p><a href=\"https://www.change.org/p/the-people-warner-bros-bring-johnny-depp-back-as-gellert-grindelwald\" rel=\"nofollow\">https://www.change.org/p/the-people-warner-bros-bring-johnny-depp-back-as-gellert-grindelwald</a></p>\n<p><a href=\"https://www.change.org/p/warner-brothers-keep-johnny-depp-as-grindelwald\" rel=\"nofollow\">https://www.change.org/p/warner-brothers-keep-johnny-depp-as-grindelwald</a></p>\n<p>We must continue to fight!</p>", "photo": {"id": "224826285", "petitionMedium": {"url": "//assets.change.org/photos/2/hp/vr/jthpVRpuPYRTDbR-800x450-noPad.jpg?1604745730", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "28021492", "createdAt": "2020-11-06T18:04:50.000Z", "title": "News from Johnny!", "description": "<p>Today Johnny posted a letter on Instagram in which he thanked us all for our support, said that he would continue to fight for his good name, <strong>but the studio forced him to sign a waiver of the role of Grindelwald, although filming had already begun, and he did it...</strong> There is no need to wait for the third part. It won't be interesting.<br>On Monday, the verdict of a London court in the libelous article in The Sun was announced. And unfortunately, the judge did not take into account any of Johnny's evidence, and sided with Heard and Sun. Thus, bringing down faith in a fair trial. I believe Johnny, and I will continue to believe, but in a world where everything is bought and sold, it is very difficult for honest people</p>", "photo": {"id": "224823358", "petitionMedium": {"url": "//assets.change.org/photos/4/lf/ka/MuLFKamPuIzPlEz-800x450-noPad.jpg?1604685891", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27636572", "createdAt": "2020-09-01T05:51:05.000Z", "title": "Filming timeline Fantastic Beasts 3", "description": "<p>Hello to all! I haven't written for a long time, probably everyone has already forgotten) I hope that everyone is safe and healthy.<br>In connection with the trial against Heard, Johnny's filming dates for Fantastic Beasts 3 were released. From early October to mid-February next year. We are gaining patience. Johnny has more time to walk around London, and then work begins!))<br>The Virginia trial will likely be postponed, but the London court verdict against The Sun should be announced soon</p>", "photo": {"id": "224528161", "petitionMedium": {"url": "//assets.change.org/photos/0/ch/qx/cocHQXOFACQOIUW-800x450-noPad.jpg?1598939466", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24854401", "createdAt": "2019-07-22T20:43:36.000Z", "title": "Victory!", "description": "<p>Finally, the news that we have been waiting for so long!<br>And thank you all for your support! Let us have a little, but still very important! Congratulations to Johnny and all of us!</p>\n<p><strong>Johnny Depp returns as Gellert Grindelwald in the third instalment of Harry Potter spin-off franchise Fantastic Beasts along with Eddie Redmayne as Newt Scamander, Katherine Waterston as Tina Goldstein, Dan Fogler as Jacob Kowalski and, of course, Jude Law as the young Albus Dumbledore. Director and longtime J.K. Rowling collaborator David Yates is also confirmed, making this film his seventh in the Harry Potter world. Filming begins in 2020 and Backstage can take an educated guess that casting director Fiona Weir will soon be confirmed as attached and casting now.</strong></p>\n<p><a href=\"https://www.backstage.com/uk/magazine/article/get-cast-with-jude-law-and-eddie-redmayne-in-fantastic-beasts-3--68620/\" rel=\"nofollow\"><strong>https://www.backstage.com/uk/magazine/article/get-cast-with-jude-law-and-eddie-redmayne-in-fantastic-beasts-3--68620/</strong></a></p>", "photo": {"id": "222336393", "petitionMedium": {"url": "//assets.change.org/photos/9/xm/tf/LgXMTFKDLTybSNc-800x450-noPad.jpg?1563828217", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24727319", "createdAt": "2019-06-20T10:05:32.000Z", "title": "Teen Choice Awards 2019", "description": "<p>Friends!<br>If you are a Twitter user, please retwitt<br><a href=\"https://twitter.com/teenchoicefox/status/1141483296280289281?s=21\" rel=\"nofollow\">https://twitter.com/teenchoicefox/status/1141483296280289281?s=21</a></p>\n<p>Americans - a special mission!<br>Johnny needs your voices!<br><a href=\"https://teenchoice.votenow.tv/\" rel=\"nofollow\">https://teenchoice.votenow.tv/</a></p>", "photo": {"id": "222232623", "petitionMedium": {"url": "//assets.change.org/photos/7/vy/tl/QVvytLXLEtgfZBd-800x450-noPad.jpg?1561025134", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24675667", "createdAt": "2019-06-09T09:15:58.000Z", "title": "Happy Birthday Johnny Depp!!!", "description": "<p>Today, Johnny Depp is 56 years old, but he is still beautiful and full of energy! I think for the artist the best gift is the new roles.</p>\n<p>Warner Brothers, you know what to do !;)</p>", "photo": {"id": "222189327", "petitionMedium": {"url": "//assets.change.org/photos/9/af/zp/IBAfzppciLsdPWv-800x450-noPad.jpg?1560071760", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24662660", "createdAt": "2019-06-06T08:03:10.000Z", "title": "Depp's biography fact", "description": "<p>Interestingly, the role in the movie \"Donnie Brasco\" (1997) Johnny received partly due to the fact that in 1994 he defeated a hotel room. He was considered dark and dangerous. And now for the role of the great dark wizard Grindelwald need to be white and fluffy?))</p>\n<p><strong>For Twitter users:</strong><br>Voting has opened for the Teen Choice Awards via Twitter. Go tweet and nominate:<br>.<br>#GellertGrindelwald for #ChoiceMovieVillain<br>.<br>#JohnnyDepp for #ChoiceSciFiFantasyMovieActor<br>.<br>#FantasticBeasts for #ChoiceSciFiFantasyMovie</p>", "photo": {"id": "222178772", "petitionMedium": {"url": "//assets.change.org/photos/4/wb/fp/nTWBfpOkjNfRFeV-800x450-noPad.jpg?1559808195", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24642022", "createdAt": "2019-06-01T12:10:09.000Z", "title": "Johnny Depp makes a movie", "description": "<p>While Amber Heard agitates and demos someone, Johnny as a director makes a documentary about George Jung, Boston George (Blow).<br>And this is a much more serious and respected occupation, besides reminding us of his stunning diligence. Photo May 30, Los Angeles.</p>\n<p>But the news of the signing of the contract for the Fantastic Beasts-3, we are still very much looking forward to!</p>", "photo": {"id": "222161745", "petitionMedium": {"url": "//assets.change.org/photos/9/cr/yy/HWCryyFasWODZlo-800x450-noPad.jpg?1559391012", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24594904", "createdAt": "2019-05-22T07:41:12.000Z", "title": "Reflections on the anniversary of sad events (and new documents)", "description": "<p>The main accusations of Heard are based on the date of May 21, 2016, and we discuss this quite easily, forgetting an important fact. May 20, Johnny's mother died. After a long severe illness. Knowing his love and affection for her, you can try to imagine what his emotional state was! In deep grief and mourning! Even if that were the type of outbreaks of aggression, everything is easily debited to the state of affect. And in April-May, he probably wanted to spend time next to his mother, and not this all since the pile of shit on the bed and everything that happened after ... And the fact that Amber-gang became active at this particular time leads to different thoughts. And Heard describes  as a soulless, heartless creature, not capable of a gram of sympathy (which is normal even strangers are capable of), but only putting shit in the literal and figurative sense ... It’s clearer who is who view of logic, common sense and moral and ethical standards.<br>On May 20 of this year (Monday) Johnny presented in court a declaration of how Amber scoffed at him. You can read the link. </p>\n<p><a href=\"https://www.dropbox.com/s/fu9959f7v21ejbw/Depp-Declaration.pdf?dl=0\" rel=\"nofollow\">https://www.dropbox.com/s/fu9959f7v21ejbw/Depp-Declaration.pdf?dl=0</a></p>\n<p>Nervous - with caution)<br>Or in the article \"The Blast\"</p>\n<p>And about the comments of the lawyer Heard. Someone has just whipped himself up once again)) Who bothers anyone? Johnny? Not! He does what he has to. But Amber, it seems, will die of longing and own poison, if she does not come up with another crap, and Johnny will be all right. (And he will be! A little earlier or a little later, but it will definitely be!;))</p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "The Blast", "photoUrl": "https://theblast.com/wp-content/uploads/2019/05/0520_Johnny-Depp-Amber-Heard.jpg", "description": "Johnny Depp is speaking out for the first time in his own words about the allegations of abuse levied against him by his ex-wife, Amber Heard , saying, \"Ms. Heard's fabricated domestic violence allegations against me are categorically and demonstrably false.\""}}, {"__typename": "StarterPetitionUpdate", "id": "24560780", "createdAt": "2019-05-15T21:25:31.000Z", "title": "Dawn is coming!", "description": "<p><em>\"We gotta rise, let's rise! We gotta rise, let's rise above the lies, it's you and I, it's do or die, we gotta rise, let's rise above the lies!\" (New song of Hollywood Vampires)</em></p>\n<p>Very nice article published on hollywoodlife.com<br>Key points:<br>“He has a couple of movies filmed, preparing for release, <strong>and is about to sign onto to reprise his role in the third installment of Fantastic Beasts</strong>,” the source tells HollywoodLife.com. “He is not dating anyone, but instead, healing and moving on from the Amber drama while letting his lawyers fight on his behalf and restore his reputation in Hollywood. Johnny is not with the Russian dancer, as was rumored, nor [is he] eager to jump into any new relationship. Instead, he is focused on his music, his band, his film career, and his family.”<br>----<br>While Johnny continues to rock out, his legal team is pursuing the $50 million defamation lawsuit he filed in March 2019 – and they won’t give up until he gets what he wants. “Johnny’s legal team will not relent unless Amber issues a full retraction and an apology,” the source tells HollywoodLife.com. “This is the only solution which will satisfy Johnny and his legal team. Otherwise they will see this case through.”</p>\n<p>Amen! Amen! Amen! </p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Hollywood Life", "photoUrl": "https://pmchollywoodlife.files.wordpress.com/2019/05/johnny-depp-possible-new-girlfriend-ftr.jpg?fit=440%2C330", "description": "Johnny Depp, 55, keeps a packed schedule. The actor - who has a pair of movies coming out next year - has been on tour with his group, Hollywood Vampires, and has been embroiled in a defamation lawsuit against his ex-wife, Amber Heard, 32."}}, {"__typename": "StarterPetitionUpdate", "id": "24545141", "createdAt": "2019-05-12T16:49:59.000Z", "title": "For a smile", "description": "<p>While Johnny has the tour of America with Hollywood vampires, and a slight lull, we smile a little (but with a sense).</p>", "photo": {"id": "222074065", "petitionMedium": {"url": "//assets.change.org/photos/6/dj/wg/JpDjWGdOPNmGOQH-800x450-noPad.jpg?1557679801", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24514140", "createdAt": "2019-05-05T19:01:02.000Z", "title": "Abuse and gender roles", "description": "<p>I planned this post 2 weeks ago, but more important topics appeared. Today, I think, it is time.<br>Let's look at what is abuse and talk a little about gender roles. To make it a little clearer. I began to read psychological articles on this topic, and I really did not like one thing! Most articles emphasize that a man is a rapist, a woman is a victim. Absolutely stereotypical thinking in our time, when stereotypes are crumbling everywhere. If we are talking about equality, then not only equality of rights, but also equality of responsibility! And I think Johnny suffers in part from this stereotypical thinking too! And with certain efforts, the “Depp case” could be a precedent for the protection of male victims!<br>Why it happens? Yes, probably men are mostly physically stronger (although not always!). But an abuse (as it is written in those articles) is not only physical violence, but also moral, emotional, psychological ... And this is already the \"power\" of women. Tell me, who better get the brain out?;) The answer is unequivocal, with a few exceptions.<br>In addition, because of these same stereotypes, men find it harder to fight. Potential victims are most likely brought up so that you can not raise a hand against a woman. And if he answer, then what will happen? Public opinion will say \"AAA, he is a scoundrel, he beats women!!!\" And now he find yourself guilty. Secondly, it is difficult to tell someone, complain. They will be called a wimp and a rag. Also so-so pleasure. It remains to endure and be silent, increasingly destroying his personality. Only in a truly equal society should all cases be treated in the same way and everyone should be entitled to protection.</p>\n<p>So what are the signs of an abuse?<br>Constant quibbles to the smallest shortcomings (the fact that ideals do not exist in principle are completely ignored), jealousy, bans on communication with family and friends, total control, humiliation and disrespect for values ​​and needs (I can, but you don’t). The unpredictability of punishments. It is very difficult to understand what you are doing wrong. From this the feeling of guilt and inferiority is fixed in the victim. And the alternation of periods of violence with periods of peace, when it seems that everything is finally adjusted. And the abuser gives it all as a concern for a partner, so at the beginning of a relationship it can be difficult to figure out where you are. And this is a big danger.<br>(And now look at Amber and her relationship with Johnny, and you will see all this. Google to help). For illustration - one of her fresh photos. Eloquently enough</p>", "photo": {"id": "222046605", "petitionMedium": {"url": "//assets.change.org/photos/2/os/lr/JlOsLRVwleZUMpr-800x450-noPad.jpg?1557082864", "processing": false}}, "video": null, "embeddedMedia": null}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjEx", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "14986339", "slug": "warner-brothers-save-johnny-depp-as-gellert-grindelwald-in-the-movie-fantastic-beasts", "user": {"id": "39067970", "displayName": "Илона Сотмари-Реваи", "photo": {"id": "221982079", "userSmall": {"url": "//assets.change.org/photos/2/ua/fs/tLuAFsJOWEDOmpG-48x48-noPad.jpg?1555590275", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "24496330", "createdAt": "2019-05-01T16:32:32.000Z", "signatureCount": 250}, {"__typename": "MilestonePetitionUpdate", "id": "24494769", "createdAt": "2019-05-01T08:28:52.000Z", "signatureCount": 200}, {"__typename": "MilestonePetitionUpdate", "id": "24494759", "createdAt": "2019-05-01T08:25:25.000Z", "signatureCount": 200}, {"__typename": "StarterPetitionUpdate", "id": "24489582", "createdAt": "2019-04-30T04:11:58.000Z", "title": "Dates and limits", "description": "<p>Hello! Today 2 news!<br>1. Not \"yes\", but not \"no\", so we believe and hope that Johnny, and not someone else, will show us the power of Grindelwald!;)</p>\n<p>Warner Bros. announced the third “Fantastic Beasts” film will hit theaters on Nov. 12, 2021. Production on the movie is expected to begin in spring of 2020. Wait a long time, but we will wait!<br>Full news: <a href=\"https://variety.com/2019/film/box-office/fantastic-beasts-3-release-date-1203200115/\" rel=\"nofollow\">https://variety.com/2019/film/box-office/fantastic-beasts-3-release-date-1203200115/</a></p>\n<p>2. Johnny is ready to fight to the end to clear his name!</p>\n<p>“His response to her latest motion to dismiss (transfer venue) is due on Monday, May 20, after which Amber’s reply will then be due May 31. <br>Johnny will lay out proof of his allegations that Amber and her friends carried out a series of abuse hoaxes targeting him. With no hearing date yet set, and a series of motion victories behind him, he has already put a lot of time and energy into clearing his name from her nasty allegations.”</p>\n<p>“As long as it takes, Johnny will use the courts to carry out justice until his name in Hollywood is cleared and his reputation is restored. She harmed him a lot back when he wasn’t defending himself; now he recognizes he must engage fully in this legal battle until her allegations are totally disproven. Johnny is not going to get trampled on any longer.”</p>\n<p><strong>Adam Waldman: “Before the evidence fully reveals this previously arrested, violent abuser’s latest charade, here is a question: what actual abuse victim presents an easily disprovable hoax to the court to obtain a temporary restraining order when they claim to possess other real evidence of abuse,” Johnny’s attorney continued. “That Amber Heard is allowed to pretend none of this is happening, and glide from one ‘philanthropic’ photo op to the next, is a grotesque insult to the pain and experiences of real abuse victims of every gender.”</strong></p>\n<p>Full text: <a href=\"https://hollywoodlife.com/2019/04/28/johnny-depp-not-backing-down-legal-battle-amber-heard/\" rel=\"nofollow\">https://hollywoodlife.com/2019/04/28/johnny-depp-not-backing-down-legal-battle-amber-heard/</a></p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24477318", "createdAt": "2019-04-26T20:53:28.000Z", "title": "News of the week", "description": "<p>Hi, loyal! Thank you for being there, but we need more people! Please remind the petition and familiar and unfamiliar!<br>Today about the current.<br>Earlier this week, it was announced that Amber Heard stylist Samantha McMillen testified in court that in the days when Johnny allegedly severely beat Amber (December 15, 2015 and May 24, 2016), there were no signs of violence on her! These are very important readings! And after a couple of days, suddenly everyone starts writing about a Johnny's new girl. And it is replicated everywhere, unlike the information about the court! Accident? I do not think! Most likely - conscious stuffing and provocation from those who are very afraid of losing! Therefore, it is simply necessary not to pay attention to this, not to participate in the \"yellow\" discussions, not to be distracted from the main thing! Naturally wanting Johnny happiness, good luck and prosperity.</p>\n<p>And a little comment by Alice Cooper on Johnny's lyrics on the new Hollywood Vampires album:</p>\n<p>\"I think [Johnny] wrote a lot of songs on this album that are [to] get back at people,\" Cooper tells Ultimate Classic Rock in a new interview. \"[The album's first single] 'Who's Laughing Now' is him going, 'Okay, you've set out everything you can do to destroy me, who's laughing now? I'm still here. And I'm making these records and I'm still going to make movies and I'm still a better actor than most of the people out there. Who's laughing now?' There's two or three songs like that on the album that I'm singing and going, 'Wow, I'm the voice of Johnny's anger. [Laughs] Normally, I'm writing songs that concern me. Now, I'm sort of the mouthpiece for Johnny, which is great.\"</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "24454339", "createdAt": "2019-04-21T19:50:11.000Z", "title": "Gave poisonous treats to the innocent priest (C)", "description": "<p>Happy Easter, who celebrates!<br>Thank you for already more than 120 votes!<br>Today I want to speculate a little.<br>I was very hooked by the phrase from the new Hollywood vampires song \"Who's Laughing Now\", which I put in the headline. (If suddenly someone does not know, this is the band in which Johnny plays the guitar).<br>Without taking a direct meaning now, but a little about something else ... Johnny is an actor from God! He is not a performer, he is a Creator, an Artist! He does not do only what is written in the script, and what the director wants, he changes, processes, thinks out ... He makes the character live, not cardboard. And for the attentive viewer in his roles there is always a thought, a meaning, a message...<br>And such a person has recently been trying to extinguish. Constantly diverting his attention to the courts and the prosecution, one is more ridiculous than the other. This is real sabotage! To distract from filming, blocking roles and already finished films (as happened with the City of Lies)... Not to give the Message... This is much more serious than if it were only for him, it is a crime against culture and world cinema, deicide (also the word from the song).<br>Let it sound loud, but it's true, Johnny Depp is already in the gold fund, no matter what happens next, but I really want him to do a lot more so that we have Grindelwald and many others. So that the creator could create!</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "24452782", "createdAt": "2019-04-21T08:03:13.000Z", "signatureCount": 100}, {"__typename": "StarterPetitionUpdate", "id": "24449782", "createdAt": "2019-04-20T08:39:34.000Z", "title": "Fog everywhere", "description": "<p>Thanks to those 75 people who are currently subscribed! Attract your friends and acquaintances, please! Let as much as possible Deppheads know about it.</p>\n<p>Some news. But first we need to remember the old omen \"a thief often shouts first: \"hold the thief!\"\"</p>\n<p>In the trial Depp with his former lawyers from the firm Bloom Hergott about financial differences, suddenly appeared the topic Amber Heard. Bloom Hergott suddenly wanted to ask former Warner Bros. chairman Kevin Tsujihara did Johnny ask him to remove Heard from Aquaman and blacklist at the studio or not.</p>\n<p>Depp’s attorney, Adam Waldman, tells The Blast, “The Hollywood Reporter story alleging Johnny Depp attempted to ‘blacklist’ Amber Heard from Aquaman is a last-ditch effort by defendants to smear Mr. Depp using an evidence-free media and clickbait. It is merely the latest false assertion, anonymously injected into the media by defendants being sued by Johnny Depp for tens of millions of dollars, purposed to save their skins and delay a looming day of reckoning in a court of law.” Waldman claims that not only did Depp not try and have Heard fired from “Aquaman,” it’s really the other way around. He says, “Grotesquely, the truth is the opposite of their latest \"blacklist allegation\": according to the New York Post, \"senior executives at Warner Bros.,\" who are the company’s #Metoo leadership and personally close with Amber Heard, claimed a week ago that Warner Bros. would throw Johnny Depp off the \"Fantastic Beasts\" movie franchise in which he stars because of Ms. Heard’s abuse hoax, notwithstanding that it has been thoroughly disproven by police and other sworn testimony, photographs, audio tape and 87 surveillance videos. Ms. Heard has herself previously been arrested and incarcerated for domestic violence.”</p>\n<p>Yes, Mr. Waldman, we really hope so!</p>\n<p>!!!\"These matters will be determined by the Court, not the Hollywood Reporter, nor by People Magazine, whose employee conspired with Ms. Heard to put her hoax on its cover. Mr. Depp will have his days in courts; these lies will never survive the disinfecting sunlight of evidence.”!!!</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "24448177", "createdAt": "2019-04-19T20:00:48.000Z", "signatureCount": 50}, {"__typename": "MilestonePetitionUpdate", "id": "24438777", "createdAt": "2019-04-17T15:52:55.000Z", "signatureCount": 25}, {"__typename": "MilestonePetitionUpdate", "id": "24437068", "createdAt": "2019-04-17T07:02:53.000Z", "signatureCount": 10}, {"__typename": "MilestonePetitionUpdate", "id": "24435854", "createdAt": "2019-04-16T22:27:31.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjIz", "hasNextPage": false}}}}}], "count": 2, "cursors": ["", "YXJyYXljb25uZWN0aW9uOjEx"]}