{"results": [{"data": {"petition": {"id": "13103406", "slug": "sadiqkhan-amberrudd-london-needs-an-urgent-plan-to-end-knife-gun-crime-take-action-now", "user": {"id": "244129161", "displayName": "Alexander Aina", "photo": {"id": "220473465", "userSmall": {"url": "//assets.change.org/photos/5/sh/uo/XkSHuoTPCScDwqo-48x48-noPad.jpg?1523020655", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "26891640", "createdAt": "2020-06-08T03:35:16.000Z", "signatureCount": 150000}, {"__typename": "DmResponsePetitionUpdate", "id": "24409280", "createdAt": "2019-04-10T15:43:45.000Z", "title": "Sadiq Khan", "description": "Dear Petitioner, \n\nThank you for the petition submitted on the change.org website about your concerns around rising knife crime.\n \nThe Mayor understands your concerns and has made tackling violence a key priority. He has been clear that the levels of violence, which have risen in London and around the country, are too high. Every life lost to violence is a tragedy and every injury has serious impacts on those affected and touches London’s wider communities. \n\nThe Mayor has urged the Government to reverse the £850 million of cuts forced on the Metropolitan Police Service (MPS), because of Government underfunding. The MPS has already had to make significant cuts since 2013-14 and will be required to reduce expenditure by a further £263 million by 2022-23.\n\nTo make up for these cuts the Mayor has recently announced through his budget that he will be giving an additional £234 million for policing and tackling crime. This includes the £95 million announced earlier in the budget process which has been funded mostly from an 11% increase to the Mayor’s council tax policing precept which is an equivalent of 46p a week. These funds will be used to enable the police to carry out the vital work of protecting our city, through initiatives like the Violent Crime Task Force (VCTF) which enables the MPS to be even more proactive on the streets of the capital, bearing down on violent crime and serious criminality. \n\nThe VCTF has already achieved a number of successes, between its launch in in April 2018 and February 2019, the taskforce has carried out 5,910 weapons sweeps, recovered 610 knives, 450 offensive weapons, 230 firearms and arrested 3,049 suspects.\n\nHowever, the Mayor is aware that enforcement is not the only solution and therefore he has committed £6.8 million to establish a Violence Reduction Unit (VRU). The VRU will include specialists in health, youth and social services to lead a long-term public health approach to tackle the causes of violent crime. The VRU will build on the approaches taken in Glasgow, where a similar approach has delivered large reductions in violence over the past decade.\n\nIn addition, the Mayor has also created the Young Londoners Fund (YLF) to help London’s children and young people fulfil their potential, particularly those at risk of getting caught up in crime. The Mayor’s initial investment of £45 million into the YLF will support a range of education, sport and cultural activities for children and young people, at a time when government cuts have had a devastating impact on the preventative and youth services which we need to keep our city safe.\n\nFinally, the Mayor’s ongoing social media campaign LondonNeedsYouAlive #LNYA raises awareness of the consequences of knife crime and provides reassurance and advice for people who are concerned about someone’s involvement in knife crime. A toolkit has been developed for schools, colleges, community groups, parents and others to make use of the campaign’s materials. More details about this, and other work carried out by the Mayor’s Office, can be found on the City Hall website through the following link: www.london.gov.uk/london-needs-you-alive. \n\nTaken together, this short-term enforcement by the police and long-term preventative activity in London will deliver a relentless focus on tackling knife crime and violence across the capital. \n\nOnce again, thank you for petitioning about this important issue. I hope that this provides some reassurance that the Mayor is committed to doing all he can to tackle the rise in knife crime in London and making London an even safer place for all.\n\nYours sincerely\n\n\nPublic Liaison Unit\nGreater London Authority", "photo": null, "video": null, "embeddedMedia": null, "dmResponse": {"id": "42073", "decisionMaker": {"id": "456252", "displayName": "Sadiq Khan", "photo": {"id": "134264843", "userSmall": {"url": "//assets.change.org/photos/3/if/zj/zQifzjNfThSDaqq-48x48-noPad.jpg?1528327829", "processing": false}}}}}, {"__typename": "DmResponsePetitionUpdate", "id": "22789129", "createdAt": "2018-05-25T14:14:18.000Z", "title": "Sadiq Khan", "description": "Dear Petitioner\n\nThank you for the petition submitted on the change.org website about the need for a plan to end knife and gun crime.\n\nThe Mayor’s Office for Policing And Crime (MOPAC) would like to reassure you that making London safer for young people is a critical part of the Mayor’s manifesto and his 2017-2021 Police and Crime Plan.  \n\nIn addition, the Mayor has published a tough new Knife Crime Strategy for London. Please find a link to the strategy here: www.london.gov.uk/sites/default/files/mopac_knife_crime_strategy_june_2017.pdf.\n\nThe strategy includes the following key areas; \n\n\tTargeting lawbreakers – recognising that knife crime has increased and that this is a major concern for the public, the Mayor, and the police. Commitments in this section are focussed on the immediate enforcement response to knife crime; \n\tKeeping deadly weapons off our streets - addressing the accessibility and availability of knives focusing on retailers and licensing;\n\tProtecting and educating young people – recognising the importance of prevention and working alongside schools; \n\tStanding with communities, neighbourhoods and families against knife crime – working with Londoners who want to stand up against knife crime and the harm it does to communities and families; \n\tSupporting victims of knife crime – ensuring that improving support to victims is at the heart of a holistic response; \n\tOffering a way out of crime – recognising that young people should be offered interventions which help them move away from criminality towards a brighter future.\n\nPrevention and early intervention through a public health approach, play a key part of the strategy, helping to ensure that schools, health professionals and communities play their vital role in addressing knife crime. \n\n\n\nThrough the Knife Crime Strategy: \n\n•\tThe Mayor is investing an additional £110m for the Metropolitan Police Service (MPS) next year, to deliver 1,000 additional officers than would otherwise be possible. \n•\tThe Mayor has allocated a £15m fund specifically for the MPS to tackle knife crime this financial year and create a new Violent Crime Taskforce with 120 officers. This will be invested in frontline policing, as well as improving the capacity of the MPS analytics, fast unmarked cars and police preventative work.\n•\tEvery London borough now has a bespoke knife crime action plan created in partnership with the MPS. \n•\tEvery school in London can now receive a knife wand. (200 wands have already been disseminated). \n•\tThe Mayor opened an Knife Crime Education Summit in October 2017, bringing together education providers, education leaders, Principals, Academy Trust Chairs, board members and Governmental bodies to understand better their needs and agree a plan of action to help tackle knife crime\n•\tThe Mayor is working closely with Ofsted and headteachers to improve action taken by schools to prevent knife crime, and to support the school community in the event of an incident. \n•\tThe Mayor is working to increase the number of Safer Schools Officers across the capital. 319 safer school’s officers are currently in place and we are working with the MPS to provide more.\n•\tThe Mayor has recently allocated a total of £1.4m to support 43 grass root community led anti-knife crime projects across the capital, alongside the Mayor’s £45m Young Londoners Fund. \n•\tOver the next two years, through the London Crime Prevention Fund, in partnership with 32 London boroughs, MOPAC is sustainably funding 38 projects, at a value of approximately £5m, to keep Children and young people safe.\n•\tMOPAC is creating the London Knife Crime Dashboard which will be publicly available soon. \n•\tThe Mayor has dedicated £7m to projects to help tackle youth violence, including: Gang Exit (£500,000), Information Sharing to Tackle Violence (£168,000), Victim Support Children & Young people (£360,861), and youth projects under the London Crime Prevention Fund (£5,295,717).\n•\tThe total funding allocated to the 23 gang-related projects was £4.27m in 2017/18 and £4.04m in 2018/19.\n\nThe Mayor’s Knife Crime Strategy also committed to developing a media campaign targeted towards young people raising awareness of the dangers and consequences of knife crime; and providing reassurance and advice on what they can do if they have concerns about an individual. This campaign, LondonNeedsYouAlive #LNYA, was launched on 15 November 2017. For more information go to: www.london.gov.uk/london-needs-you-alive. \n\nBoth the Mayor’s Police and Crime Plan and Knife Crime Strategy have a focus on creating positive change; addressing underlying vulnerabilities and strengthening protective factors such as environmental and socio-economic challenges. I hope that this provides some reassurance that these issues are taken extremely seriously, and that the Mayor is committed to making London an even better and safer place for all.\n\nYours sincerely\nPublic Liaison Unit", "photo": null, "video": null, "embeddedMedia": null, "dmResponse": {"id": "41059", "decisionMaker": {"id": "456252", "displayName": "Sadiq Khan", "photo": {"id": "134264843", "userSmall": {"url": "//assets.change.org/photos/3/if/zj/zQifzjNfThSDaqq-48x48-noPad.jpg?1528327829", "processing": false}}}}}, {"__typename": "MilestonePetitionUpdate", "id": "22685196", "createdAt": "2018-04-27T06:26:23.000Z", "signatureCount": 100000}, {"__typename": "MilestonePetitionUpdate", "id": "22650395", "createdAt": "2018-04-18T14:25:49.000Z", "signatureCount": 75000}, {"__typename": "StarterPetitionUpdate", "id": "22642005", "createdAt": "2018-04-16T12:42:36.000Z", "title": "Thank you all. New VIDEO please share! We need the attention of @sadiqkhan @amberrudd", "description": "Hiya everyone, we currently have an amazing 70,000 signatures and the number is still growing. Thank you all for your ongoing support. It's genuinely amazing. Something special. I am still trying to get the attention of Sadiq Khan and Amber Rudd. I'm happy they're taking the issue more seriously but I want them to produce a long-term solution that doesn't just criminalize young people and impressionable children but helps stop them from getting involved in violent crime in the first place and works on some of the deeper problems in these communities that are being affected by violence. Change.org have helped me make this video about my campaign to help raise awareness. Can you please help me keep the pressure up by sharing the video\nYou can share on facebook here:\nhttps://www.facebook.com/Change.orgUK/videos/1630546517063581/\nand on twitter here\nhttps://twitter.com/UKChange/status/985812042547433472\n\nThanks for your ongoing support", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "22617327", "createdAt": "2018-04-10T15:29:54.000Z", "title": "Amber Rudd announces a preliminary action plan", "description": "Amber Rudd has recently announced a preliminary action plan. Your voices are being heard! A massive thank you and so much love to all of you who have supported and shared this petition. The progress being made is definitely due to your voices and support. However, this is just the beginning of hopefully something that will truly improve the lives of some of the more forgotten in our country. I don't think the Home Secretary's current plan is good enough. I don't think simply increasing the number of stop and searches in the capital will tackle an issue like violent crime. Currently, the rate of violent crime in the capital is higher than in New York and what we need is a progressive, enforceable solution. Stop and searches are not that. The problem is a deep one with no simple solution and it is surprising the government do not understand that. It is lazy and apathetic of our government to believe that increasing stop and searches is really the best answer. Many factors like the reduction in police numbers, in investment in the education sector and services for young people are definitely contributors to a complex issue. It feels like the government has not put any effort into speaking to local people or any of our community leaders to understand this. \n\nAfter being stopped and searched most days I got off the tube to go college, I can say from experience they isolate members of our society. It feeds off stereotyping to categorize and label people, and immediately puts them in a box that segregates them from society. I can tell you from experience being stopped and searched daily if not weekly as a young person is damaging, saddening and alienating. It tells me society does not trust me or want me to be part of it. What the government should be aiming for is a long-term solution that is forward-thinking and addresses underlying problems. They were elected into their positions to work for the people not to pit us against each other or throw us lazy, half-baked approaches from an archaic era that have been proven to not work in the long run!", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "22615496", "createdAt": "2018-04-10T04:38:43.000Z", "signatureCount": 50000}, {"__typename": "MilestonePetitionUpdate", "id": "22608053", "createdAt": "2018-04-08T07:04:41.000Z", "signatureCount": 40000}, {"__typename": "MilestonePetitionUpdate", "id": "22605639", "createdAt": "2018-04-07T13:17:27.000Z", "signatureCount": 35000}, {"__typename": "MilestonePetitionUpdate", "id": "22604831", "createdAt": "2018-04-07T07:50:17.000Z", "signatureCount": 30000}, {"__typename": "MilestonePetitionUpdate", "id": "22603572", "createdAt": "2018-04-06T21:06:25.000Z", "signatureCount": 25000}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjEx", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13103406", "slug": "sadiqkhan-amberrudd-london-needs-an-urgent-plan-to-end-knife-gun-crime-take-action-now", "user": {"id": "244129161", "displayName": "Alexander Aina", "photo": {"id": "220473465", "userSmall": {"url": "//assets.change.org/photos/5/sh/uo/XkSHuoTPCScDwqo-48x48-noPad.jpg?1523020655", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "22603049", "createdAt": "2018-04-06T18:24:50.000Z", "signatureCount": 20000}, {"__typename": "MilestonePetitionUpdate", "id": "22602884", "createdAt": "2018-04-06T17:29:43.000Z", "signatureCount": 17500}, {"__typename": "MilestonePetitionUpdate", "id": "22602765", "createdAt": "2018-04-06T16:48:06.000Z", "signatureCount": 15000}, {"__typename": "MilestonePetitionUpdate", "id": "22602674", "createdAt": "2018-04-06T16:15:54.000Z", "signatureCount": 12500}, {"__typename": "MilestonePetitionUpdate", "id": "22602607", "createdAt": "2018-04-06T15:51:42.000Z", "signatureCount": 10000}, {"__typename": "MilestonePetitionUpdate", "id": "22602580", "createdAt": "2018-04-06T15:43:27.000Z", "signatureCount": 9000}, {"__typename": "MilestonePetitionUpdate", "id": "22602553", "createdAt": "2018-04-06T15:36:12.000Z", "signatureCount": 8000}, {"__typename": "MilestonePetitionUpdate", "id": "22602540", "createdAt": "2018-04-06T15:32:30.000Z", "signatureCount": 7500}, {"__typename": "MilestonePetitionUpdate", "id": "22602522", "createdAt": "2018-04-06T15:29:30.000Z", "signatureCount": 7000}, {"__typename": "MilestonePetitionUpdate", "id": "22602495", "createdAt": "2018-04-06T15:23:38.000Z", "signatureCount": 6000}, {"__typename": "MilestonePetitionUpdate", "id": "22602474", "createdAt": "2018-04-06T15:18:22.000Z", "signatureCount": 5000}, {"__typename": "MilestonePetitionUpdate", "id": "22602462", "createdAt": "2018-04-06T15:14:17.000Z", "signatureCount": 4000}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjIz", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13103406", "slug": "sadiqkhan-amberrudd-london-needs-an-urgent-plan-to-end-knife-gun-crime-take-action-now", "user": {"id": "244129161", "displayName": "Alexander Aina", "photo": {"id": "220473465", "userSmall": {"url": "//assets.change.org/photos/5/sh/uo/XkSHuoTPCScDwqo-48x48-noPad.jpg?1523020655", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "22602451", "createdAt": "2018-04-06T15:10:09.000Z", "signatureCount": 3000}, {"__typename": "MilestonePetitionUpdate", "id": "22602439", "createdAt": "2018-04-06T15:07:28.000Z", "signatureCount": 2500}, {"__typename": "MilestonePetitionUpdate", "id": "22602429", "createdAt": "2018-04-06T15:04:44.000Z", "signatureCount": 2000}, {"__typename": "MilestonePetitionUpdate", "id": "22602421", "createdAt": "2018-04-06T15:02:07.000Z", "signatureCount": 1500}, {"__typename": "MilestonePetitionUpdate", "id": "22602405", "createdAt": "2018-04-06T14:59:08.000Z", "signatureCount": 1000}, {"__typename": "MilestonePetitionUpdate", "id": "22602399", "createdAt": "2018-04-06T14:57:17.000Z", "signatureCount": 750}, {"__typename": "MilestonePetitionUpdate", "id": "22602384", "createdAt": "2018-04-06T14:54:57.000Z", "signatureCount": 500}, {"__typename": "MilestonePetitionUpdate", "id": "22602372", "createdAt": "2018-04-06T14:51:49.000Z", "signatureCount": 250}, {"__typename": "MilestonePetitionUpdate", "id": "22602356", "createdAt": "2018-04-06T14:47:06.000Z", "signatureCount": 200}, {"__typename": "MilestonePetitionUpdate", "id": "22602200", "createdAt": "2018-04-06T14:03:05.000Z", "signatureCount": 100}, {"__typename": "MilestonePetitionUpdate", "id": "22602157", "createdAt": "2018-04-06T13:52:31.000Z", "signatureCount": 50}, {"__typename": "MilestonePetitionUpdate", "id": "22602143", "createdAt": "2018-04-06T13:48:19.000Z", "signatureCount": 25}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjM1", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13103406", "slug": "sadiqkhan-amberrudd-london-needs-an-urgent-plan-to-end-knife-gun-crime-take-action-now", "user": {"id": "244129161", "displayName": "Alexander Aina", "photo": {"id": "220473465", "userSmall": {"url": "//assets.change.org/photos/5/sh/uo/XkSHuoTPCScDwqo-48x48-noPad.jpg?1523020655", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "22602116", "createdAt": "2018-04-06T13:41:19.000Z", "signatureCount": 10}, {"__typename": "MilestonePetitionUpdate", "id": "22602057", "createdAt": "2018-04-06T13:25:43.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjM3", "hasNextPage": false}}}}}], "count": 4, "cursors": ["", "YXJyYXljb25uZWN0aW9uOjEx", "YXJyYXljb25uZWN0aW9uOjIz", "YXJyYXljb25uZWN0aW9uOjM1"]}