{"results": [{"data": {"petition": {"id": "10754237", "slug": "the-foundations-of-liberty-act", "user": {"id": "699017609", "displayName": "Jamie Aiken", "photo": {"id": "170710127", "userSmall": {"url": "//assets.change.org/photos/6/is/sf/aYiSsfXPufezFzU-48x48-noPad.jpg?1490114640", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "25836046", "createdAt": "2020-03-03T15:23:51.000Z", "title": "The Unmentionable Motto", "description": "<p>Clearly, a motto is something that the entity who chose it is proud to share. Why then has our American motto become unmentionable? What changed? Today, young people do not even know that our motto is \"In God we Trust.\"  Though it still remains a relic on our currency, try scheduling me to come do a presentation at a public school on this topic. Though I am well-prepared to give the presentation... both historically and philosophically... I doubt I'll be getting any calls. How did our nation's motto become so controversial... even out-of-bounds... even defacto forbidden in the public schools paid for with our tax dollars?</p>\n<p>The political discourse of our Republic has changed tremendously during the past decades. In our nation's infancy, ideological struggles were waged for the purpose of best articulating foundational ideas as well as providing the structural mechanisms to implement them. Today, the hope and promise of lifting everyone to the \"Pursuits of Happiness\" is overshadowed by merely selecting the best agents to vanquish our political adversaries... to win for \"our side\"... whatever \"winning\" has become.</p>\n<p>Today, political discussions quickly degenerate into often bitter, generally purposeless attacks. Thus, the refinement of ideas has been abandoned for sectarian feeding frenzies... the destruction of people rather than the illumination of truth. Obviously, our nation's original motto \"Out of many, one\" cannot be accomplished when raw hatred is consistently spewing throughout the culture... ever more bloodletting as pundits toss chum into the murky waters. In all of it, the idea of a \"Shining City on a Hill\" is quickly becoming an unknown notion... much less an impassioned quest.</p>\n<p>Rather than focusing on actionable solutions to serious problems, the prevailing modus operandi is simply cursing villains... both real and imagined. And so, vehement soundbites echo across the emotions... rantings that feed the most base elements of human fear, envy and anger. On the other side of the world from \"loving one's neighbor\" is the incubation of justifications to steal from him... from his character, his achievements, his freedoms, his hard work... even literally stealing his possessions. In stark contrast, schoolchildren used to know and believe a profound moral underpinning: \"One nation... under God... Indivisible... with Liberty and Justice for All!\" Furthermore, we used to believe and stand upon our country's motto: \"In God we Trust.\"</p>\n<p>If such a nation is still desired, we must begin to take concrete action... to return to the principles that made America a light to the world in the first place. \"Winning\" without principle is not winning at all. Rather, it is losing the \"Life, Liberty, and the Pursuit of Happiness\"... endowed by our Creator... enshrined by our Founders... preserved by the blood of patriots from 1776 to today. If we can longer trust in a Power above human power... the \"Creator\" of our sacred Rights of Life and Liberty... in what shall we then put our trust?</p>\n<p>There is still time to seize the wondrous opportunities bestowed upon us! On this day, we can choose to stand up... even shout from the rooftops! Clearly, there can be no harvest without good seeds. But friends, good news abides: Good seeds are at hand! May we lift up our eyes and consider the fertile fields... for they are still ripe for harvest! Even if the workers are few, there will be sufficiency. We are not alone in the good work... a bountiful harvest is assured! Shalom! </p>", "photo": {"id": "223183807", "petitionMedium": {"url": "//assets.change.org/photos/5/de/oj/KPDeojvBNXzcqcx-800x450-noPad.jpg?1583249033", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "25830861", "createdAt": "2020-03-02T16:37:26.000Z", "title": "Big Meeting Soon... breakthrough near!", "description": "<p>As we approach tangible action on this bill, may we be always remember \"why\" the truth is always vital.   I'll be updating soon... hopefully with great news!</p>\n<p>It would be right and good to pause and consider the gift that Providence has bestowed upon those who woke up an American citizen this morning... people with a new kind of opportunity in a new kind of land. Built upon the proposition that \"all men are Created equal,\" we find a nation dependent upon a standard... a \"Creator\"... a Source that provides such a foundation.  Today, we must ask ourselves, \"Are these truths still \"self-evident?\"</p>\n<p>Without a standard above the desires of men, there is no possibility of higher appeal... only the dictates of raw power... the cruel mechanics this world has long endured. Today in America, in almost every public realm, the standard of \"Creator\" has been removed... making such notions irrelevant... even forbidden. Does anyone doubt this?  We invite them to observe the scores of 6th graders attending Project American Life.  Upon hearing the opening to The Declaration, so many have responded, \"We're not supposed to talk about these kinds of things.  How could this be?!  even in Alabama!!! </p>\n<p>It is sobering to consider... it should be chilling that it has become a reality!  One thing is clear:  John Adams, John Quincy Adams, Frederick Douglass, Abraham Lincoln, Dr. Martin Luther King as well as countless millions of yearning souls vividly understood and understand the everlasting significance of Declaration principles.  Sure, there were Founders whose actions did not match their stated beliefs.  However, all of them had the courage to set the bar high... to declare what is true for the sake of posterity... even if declaring these new principles would cast judgment upon themselves.</p>\n<p>The world is replete with examples of certain groups claiming that they matter more than others, for this is the grisly history of mankind. Modern times provide vivid examples: the Third Reich, Pol Pot's Cambodia, the Soviet Union, Rwanda, the Middle East, the Sudan... and tragically, many more.  Are these the kinds of utopias now being sought in America?  If not, what is an example of the kind of nation now desired?</p>\n<p>Let us pause for honest consideration of the problems that vex us. Perhaps, we might discover that our collective lack of clarity is the result of forgetting who we were... what it means to be an American. For \"all\" children born this very day, there remains a higher Hope... a greatest Dream... even an abiding Promise:  \"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\"  If these Truths are still self-evident, it is time to declare them loudly once again.  \"And a little child shall lead them...\"</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "25228394", "createdAt": "2019-10-22T02:32:36.000Z", "signatureCount": 500}, {"__typename": "MilestonePetitionUpdate", "id": "23740081", "createdAt": "2018-12-10T03:48:38.000Z", "signatureCount": 250}, {"__typename": "MilestonePetitionUpdate", "id": "23734277", "createdAt": "2018-12-08T12:49:29.000Z", "signatureCount": 200}, {"__typename": "MilestonePetitionUpdate", "id": "22944986", "createdAt": "2018-06-29T14:38:57.000Z", "signatureCount": 100}, {"__typename": "MilestonePetitionUpdate", "id": "22233159", "createdAt": "2018-01-11T19:30:41.000Z", "signatureCount": 50}, {"__typename": "MilestonePetitionUpdate", "id": "21153319", "createdAt": "2017-08-24T17:26:50.000Z", "signatureCount": 25}, {"__typename": "MilestonePetitionUpdate", "id": "19815245", "createdAt": "2017-03-25T02:27:14.000Z", "signatureCount": 10}, {"__typename": "StarterPetitionUpdate", "id": "19799516", "createdAt": "2017-03-23T17:34:11.000Z", "title": "Project American Life (Phase Two)", "description": "Now is the time.", "photo": {"id": "170916299", "petitionMedium": {"url": "//assets.change.org/photos/7/va/oe/rIvaoeqgbeHjhOA-800x450-noPad.jpg?1490290454", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "19777382", "createdAt": "2017-03-21T19:03:00.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjEw", "hasNextPage": false}}}}}], "count": 1, "cursors": [""]}