{"results": [{"data": {"petition": {"id": "13534925", "slug": "julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma", "user": {"id": "898371250", "displayName": "Cece Jones-Davis #FreeJuliusJones", "photo": {"id": "223801661", "userSmall": {"url": "//assets.change.org/photos/2/cp/fd/YIcPfDVlWUSGPdg-48x48-noPad.jpg?1589988094", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "30898559", "createdAt": "2022-09-07T20:59:48.000Z", "title": "Help Us Save Others on Oklahoma's Death Row", "description": "<p>Friend,</p>\n<p>You may have already seen this update. But as someone invested in the liberation of Julius Jones, an innocent Black man who you helped free from death row last year, we wanted to make sure you had an opportunity to learn what's happening in Oklahoma right now and take action.</p>\n<p>Twenty five people have been set to be killed by the state. One person, James Coddington, was already killed two weeks ago despite the Oklahoma Parole and Pardon's board voting for clemency.</p>\n<p>Governor Stitt ignored his own appointed Parole and Pardons board, and chose death instead!</p>\n<p>The people scheduled for execution include cases with serious claims of innocence and racial bias, just like Julius’ case. Others include severe mental illness, intellectual disability, exorbitant childhood trauma and abuse. These cases reveal deep systemic flaws in Oklahoma’s capital punishment system and illustrate the egregious unfairness and cruelty of the death penalty in general.</p>\n<p>But it's never too late. If enough people make noise, we can push Governor Stitt to issue a moratorium on the death penalty.</p>\n<p>TAKE ACTION NOW - SIGN THE PETITION!</p>\n<p><a href=\"https://witnesstoinnocence.salsalabs.org/stopoklahomaexecutions/index.html\" rel=\"nofollow\">https://witnesstoinnocence.salsalabs.org/stopoklahomaexecutions/index.html</a></p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "30839715", "createdAt": "2022-08-17T20:08:31.000Z", "title": "Julius' Execution was Stopped...Now We Need to Stop Oklahoma from Executing the Next 25", "description": "<p>Dear friends,</p>\n<p><br>It’s been almost 1 year since you and 6 million others around the country took action to help successfully stop the execution of Julius Jones! We’re reaching out on behalf of Julius today to request your help to save lives in Oklahoma once again. </p>\n<p><br>Right now there are 25 people scheduled for execution in Oklahoma. We can stop these executions by once again pushing the Governor to take action and issue a moratorium on the death penalty. </p>\n<p><br><a href=\"http://bit.ly/oklahoma25\" target=\"_blank\" rel=\"nofollow\">Sign the petition</a>: Governor Stitt, please issue a death penalty moratorium and save the lives of 25 people today!</p>\n<p><br>Together we helped save Julius, a Black man who has spent the past 20 years on death row for a crime he did not commit. Though Julius is no longer on death row, he’s still serving a life sentence without the possibility of parole despite being innocent. Our fight for Julius’s liberation is not over. But as we continue to strategize for Julius’ freedom, we must also work to shut down the death penalty system that threatened his life in the first place. </p>\n<p><br>The 25 people scheduled for execution include cases with serious claims of innocence and racial bias, just like Julius’ case. Others include severe mental illness, intellectual disability, exorbitant childhood trauma and abuse. These cases reveal deep systemic flaws in Oklahoma’s capital punishment system and illustrate the egregious unfairness and cruelty of the death penalty in general. </p>\n<p><br>Together we can end the cruelty of Oklahoma’s death penalty. </p>\n<p><br>Mama Jones, Antoinette Jones, Jabee Williams, and me - Cece Jones-Davis, continue to fight for justice for Julius and others impacted by the death penalty in Oklahoma because we know too well how evil this system is. We believe that the only way to be certain that the state never puts another innocent person on death row again, is to stop this death machine all together. </p>\n<p><br>This is why we’ve teamed up with death row exonerees from the organization, Witness to Innocence to implore Governor Stitt to issue a moratorium on the Oklahoma death penalty TODAY. </p>\n<p><br>Join us in the fight for justice! <a href=\"http://bit.ly/oklahoma25\" target=\"_blank\" rel=\"nofollow\">Sign the petition</a> today. </p>", "photo": {"id": "226806983", "petitionMedium": {"url": "//assets.change.org/photos/6/zv/zb/oUZVzBHTlvCINbn-800x450-noPad.jpg?1660766919", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "30049482", "createdAt": "2022-01-10T16:21:51.000Z", "title": "Oklahoma Almost Killed Julius Jones - An Innocent Man. Death Row Must Go.", "description": "<p><strong>Happy New Year to all Justice for Julius Supporters, </strong></p>\n<p>You ventured with us through the unimaginable at the end of 2021. Julius Jones' life was spared just hours before the scheduled execution, and we are relieved that he is alive. We are more determined now more than ever to continue seeking justice for him, and address the social issues that have caused him and his family such pain for decades. </p>\n<p>That said, the death penalty must go. </p>\n<p>It almost killed an innocent man in Oklahoma in November. It <em>has</em> killed innocent people in the past. It will continue to threaten the lives of wrongfully convicted human beings if we do not dismantle it. Now. </p>\n<p>We would love your support in calling for an end to Federal executions by signing our partner, Death Penalty Action's, <a href=\"https://actionnetwork.org/petitions/urge-biden-garland-congress-scotus-end-death-penalty-now\" target=\"_blank\" rel=\"nofollow\">petition</a> TODAY. </p>\n<p>Thank you for your support. Stay with Justice for Julius in 2022 as we continue to fight for freedom for Julius Jones.</p>\n<p>Sincerely, </p>\n<p>Cece</p>\n<p> </p>\n<p> </p>\n<p> </p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Actionnetwork", "photoUrl": "https://can2-prod.s3.amazonaws.com/share_options/facebook_images/000/338/819/original/Abolish___Demolish_FB_2.png", "description": "PETITION DELIVERY JAN 17, 2022 - Please sign & share to urge President Biden, Merrick Garland, the US Congress (and the US Supreme Court) to commute all federal and military death sentences and to work with Congress to pass the Federal Death Penalty Prohibition Act of 2021."}}, {"__typename": "StarterPetitionUpdate", "id": "29865102", "createdAt": "2021-11-19T22:18:13.000Z", "title": "Julius Lives!", "description": "<p>Julius’ execution has been called off. Only three hours before he was scheduled to be executed, the governor commuted his sentence to life without the possibility of parole. </p>\n<p>We are crying tears of relief. After such a long, hard fight, Julius will live to see another day — and that is thanks to you. Thank you for every signature, every tweet, every phone call and share. We made it politically impossible for Governor Stitt to allow Julius to die. </p>\n<p><strong>Today we celebrate. Tomorrow we keep fighting.</strong> Julius still is not free. He deserves to walk out of jail and go home to his family, to be surrounded in love.</p>\n<p>The fight ahead will be long, and we’re going to need all the power we can muster. Stay tuned. </p>\n<p>Cece </p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29858761", "createdAt": "2021-11-18T14:49:42.000Z", "title": "URGENT: Stop Julius’ execution today", "description": "<p><strong>Julius will be executed today at 4 PM, unless you do something NOW. The only thing standing between him and the execution chamber is immense public pressure on Governor Stitt to do the right thing. </strong>If we can’t achieve that, an innocent man will be killed by our “justice” system. “This is not about hate,” Julius Jones said in his clemency hearing. “This is just about the truth. <strong>And the truth is, I didn’t shoot that man.”</strong></p>\n<p><a href=\"callforjulius.com\" target=\"_blank\" rel=\"nofollow\"><strong>Will you please take 3 minutes to call Governor Stitt and urge him to cancel an unjust execution? We have just a few hours to convince him.</strong></a></p>\n<p><strong>For those in Oklahoma</strong>, please join us today for our Freedom Vigil from 8 am to 12 pm. We will be stationed at 1301 N West St. McAlester, OK. <a href=\"https://www.instagram.com/p/CWZdR1rJOa2/\" target=\"_blank\" rel=\"nofollow\">Event details here.</a></p>\n<p>What happens today will determine if Julius’ family ever gets to see him again. If his mother ever gets to hug her son again.</p>\n<p><strong>Make the call. We need you now more than ever.</strong></p>\n<p>Team Justice for Julius</p>", "photo": {"id": "226108785", "petitionMedium": {"url": "//assets.change.org/photos/2/gr/fa/TlGrFANLKjRVNDy-800x450-noPad.jpg?1637246985", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29854361", "createdAt": "2021-11-17T15:53:15.000Z", "title": "LAST CHANCE TO SAVE JULIUS", "description": "<p><strong>Julius Jones’ execution is scheduled for tomorrow. Julius’ mother is the strongest woman in the world.</strong> Today, her eyes are closed in the back seat. I asked her how she was doing. She said, <strong>“I’m empty inside. I feel invisible.” This life owes Black women more than this.</strong></p>\n<p><a href=\"callforjulius.com\" target=\"_blank\" rel=\"nofollow\"><strong>Will you call Governor Stitt and urge him to adopt the recommendation from his own Pardon and Parole Board and grant Julius clemency? We have 24 hours.</strong></a></p>\n<p>Julius and his family are counting on us. We have 24 hours to save an innocent man from execution.</p>\n<p>Team Justice for Julius</p>", "photo": {"id": "226103710", "petitionMedium": {"url": "//assets.change.org/photos/0/lp/ia/rtLPiAvqBoeikxA-800x450-noPad.jpg?1637164399", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29854320", "createdAt": "2021-11-17T15:45:05.000Z", "title": "Julius Rallies Today: OK, LA, NYC, DC, NJ, MN", "description": "<p><strong>Julius Jones’ execution is scheduled for tomorrow.</strong> He currently sits on death watch. Unless Governor Stitt takes action, today will be the last time Julius ever sees his family.</p>\n<p><strong>SHOW UP FOR JULIUS TODAY IN OKLAHOMA, LA, NYC, DC, NEWARK AND MINNEAPOLIS.</strong></p>\n<p><a href=\"https://twitter.com/justice4julius/status/1460840798770114561\" target=\"_blank\" rel=\"nofollow\"><strong>EVENT DETAILS HERE</strong></a><br><strong>Oklahoma City:</strong> 8 AM - 5 PM CT at the State Capitol in front of Gov. Stitt's office on the 2nd floor<br><strong>Los Angeles:</strong> 12 PM PT on the Steps of City Hall<br><strong>New York:</strong> 3 - 5 PM ET at Washington Square Park near the large arches, look for balloons<br><strong>Washington, DC:</strong> 1 PM ET at the Intersection of 9th and Pennsylvania Ave<br><strong>Newark:</strong> 3 PM ET at the Intersection of Broad St and Market St<br><strong>Minneapolis:</strong> 2 PM CT across from the Governor's Mansion at 1006 Summit Ave, St. Paul</p>\n<p><a href=\"callforjulius.com\" target=\"_blank\" rel=\"nofollow\">If you are not able to attend an event, help us save Julius by making a quick call to Governor Stitt.</a></p>\n<p><strong>We hope to see you there. We have 24 hours to save Julius.</strong></p>\n<p>Team Justice for Julius</p>", "photo": {"id": "226103690", "petitionMedium": {"url": "//assets.change.org/photos/1/vw/vj/fwVWVJGcVjtbXKR-800x450-noPad.jpg?1637163907", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29851457", "createdAt": "2021-11-16T22:18:42.000Z", "title": "URGENT: Stop a Thursday Execution", "description": "<p><strong>Last night, the Jones family showed up at Governor Stitt’s office– and <a href=\"https://www.the-sun.com/news/4073936/julius-jones-execution-mom-begs-oklahoma-governor/\" target=\"_blank\" rel=\"nofollow\">he declined to meet with them</a>.</strong> Governor Stitt has the power to stop this execution and grant Julius life with the possibility of parole. We have just days to convince the governor to adopt this recommendation. <strong>If not, Julius will be sent to the execution chamber this Thursday.</strong></p>\n<p><a href=\"callforjulius.com\" target=\"_blank\" rel=\"nofollow\"><strong>Will you take a minute to call the governor for Julius? This is life or death.</strong></a></p>\n<p><strong>We have until Thursday to convince him to free Julius. He’s counting on us.</strong></p>\n<p>Team Justice for Julius</p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Change.org", "photoUrl": "https://p2a-images.s3.amazonaws.com/production/customers/2423/qcRI4KM1L0objRO39jAq15913795866306", "description": "I just called Oklahoma Gov. Stitt to demand clemency for Julius Jones. Will you speak up for an innocent man? Change.org/JusticeForJulius"}}, {"__typename": "StarterPetitionUpdate", "id": "29846974", "createdAt": "2021-11-15T22:23:24.000Z", "title": "Hear Julius Speak (clemency hearing footage)", "description": "<p>Last week, for the first time in 22 years, Julius Jones told his story: <strong>“I’m here to tell you what I never got to tell the jury in my trial.”</strong> Julius stood by the fact that he has “never been a violent man” and urged the Board to <strong>“examine who I am and not the fear that’s been talked about me.”</strong></p>\n<p><a href=\"https://www.instagram.com/p/CV_N3yPhTQY/\" target=\"_blank\" rel=\"nofollow\"><strong>Watch &amp; share this 2 minute video of Julius Jones' story, in his own words.</strong></a></p>\n<p><strong>As Julius gets closer to his execution date, they are moving his cell closer and closer to the execution site.</strong> Share Julius’ story with your community. This is life or death.</p>\n<p><strong>We have four days to free Julius.</strong></p>\n<p>Team Justice for Julius</p>", "photo": {"id": "226097673", "petitionMedium": {"url": "//assets.change.org/photos/3/ej/jd/OTEjJDRqlqzzzlk-800x450-noPad.jpg?1637015006", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29822032", "createdAt": "2021-11-09T14:46:37.000Z", "title": "Julius Jones is on death watch", "description": "<p>Julius Jones is on death watch – that means Julius is alone in a windowless cell, watched by a guard and camera 24/7. The only personal items he is allowed are a Bible, family photos, a pen, and paper. He is only allowed three showers a week. Julius is scheduled for execution on November 18th.</p>\n<p><strong>Julius will sit here until the day he dies unless Governor Stitt grants him clemency before November 18th.</strong></p>\n<p><a href=\"https://p2a.co/b8JuoUe\" target=\"_blank\" rel=\"nofollow\"><strong>Will you call Governor Stitt and urge him to adopt the Pardon and Parole Board’s recommendation for clemency?</strong></a></p>\n<p>We are down to the wire. If Governor Stitt does not approve the recommendation in 9 days, Julius will be executed. Call Governor Stitt and help us free Julius.</p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226075535", "petitionMedium": {"url": "//assets.change.org/photos/7/ux/lw/hquXlWQyHLCmMGq-800x450-noPad.jpg?1636469199", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29807763", "createdAt": "2021-11-05T14:24:29.000Z", "title": "We need you more than ever", "description": "<p>Last week the Pardon and Parole Board voted to commute Julius’ sentence to life with the possibility of parole. Now this is the hard part. We need you to convince the governor to adopt their recommendation.</p>\n<p><strong>Make no mistake: Julius’ life is still on the line. His execution is still scheduled for less than two weeks away.</strong></p>\n<p>Now is the moment we need you to keep up the energy. We have asked you to call before, but it remains the most important thing we can do to save Julius.</p>\n<p><a href=\"https://p2a.co/b8JuoUe\" target=\"_blank\" rel=\"nofollow\"><strong>Take 4 minutes today to call the Governor.</strong></a></p>\n<p>– Team Justice for Julius</p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Change.org", "photoUrl": "https://p2a-images.s3.amazonaws.com/production/customers/2423/qcRI4KM1L0objRO39jAq15913795866306", "description": "I just called Oklahoma Gov. Stitt to demand clemency for Julius Jones. Will you speak up for an innocent man? Change.org/JusticeForJulius"}}, {"__typename": "StarterPetitionUpdate", "id": "29792621", "createdAt": "2021-11-01T23:05:32.000Z", "title": "Breaking: Julius’ clemency hearing", "description": "<p><strong>BREAKING:</strong> <strong>Today, for the first time in 22 years, the world heard directly from Julius Jones.</strong></p>\n<p>The Oklahoma Pardon and Parole Board voted 3-1 to commute Julius Jones’ sentence to life with the possibility of parole. Governor Stitt will soon decide whether or not to adopt their recommendation.</p>\n<p><a href=\"callforjulius.com\" target=\"_blank\" rel=\"nofollow\"><strong>“It is important for you to continue to call,\" urges Julius’ sister, Antoinette. Please click to call Governor Stitt and urge him to adopt the Board's recommendation.</strong></a></p>\n<p>Antoinette Jones thanks the Parole Board for “continuing to see the human in Julius.”</p>\n<p>Hearing Julius’ story in his own words was incredibly emotional. His own sister revealed that even she did not know all the hardship Julius experienced. <strong>In his hearing, Julius shared stories about his life as a college athlete and unequivocally asserted that he did not kill Paul Howell.</strong> Julius shared, “I wish I could have made better decisions when I was younger, but I can’t change the past. I know I have broken laws, but <strong>I have never been a violent man.”</strong></p>\n<p>Today is one of the most pivotal days in Julius’ case. Call the Governor and help us free Julius.</p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226056170", "petitionMedium": {"url": "//assets.change.org/photos/5/th/cd/WlTHcDfnKLbXfxd-800x450-noPad.jpg?1635807934", "processing": false}}, "video": null, "embeddedMedia": null}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjEx", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13534925", "slug": "julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma", "user": {"id": "898371250", "displayName": "Cece Jones-Davis #FreeJuliusJones", "photo": {"id": "223801661", "userSmall": {"url": "//assets.change.org/photos/2/cp/fd/YIcPfDVlWUSGPdg-48x48-noPad.jpg?1589988094", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "29782275", "createdAt": "2021-10-29T16:05:57.000Z", "title": "UPDATE: The Supreme Court’s ruling on Julius Jones’ case", "description": "<p>Friends - A lot has happened in Julius’ case over the last few days. Here’s what you need to know:</p>\n<ol>\n<li>On Wednesday, Julius Jones and John Grant were granted a stay of execution by the United States Court of Appeals for the Tenth Circuit due to questions around the constitutionality of Oklahoma’s execution process.</li>\n<li>The State of Oklahoma appealed that decision and it went to the Supreme Court.</li>\n<li>Then yesterday, the U.S. Supreme Court voted 5-3 to move forward with the executions.</li>\n<li>This resulted in the execution of John Grant. It did not go well, and proved why Oklahoma’s lethal injection process is being challenged—and Julius could be next.</li>\n</ol>\n<p>Now, Julius’ November 18th execution date is back on and his clemency hearing will be held on Monday, November 1st at 9am CT. We’re looking forward to the opportunity for Julius to finally be heard and present the case for his innocence for the first time in over 20 years.</p>\n<p>We pray that the Pardon and Parole Board will hear the truth and recommend to Governor Stitt that he grant Julius clemency.</p>\n<p>This is truly Julius’ last chance to stop his execution. Now more than ever, we need as many people as possible to make their voices heard—<a href=\"https://p2a.co/bgmivzn?p2asource=em_20211029-ct-RJT-jjscotusupdate-actives&amp;emci=6f5ca2d7-4438-ec11-9820-c896653b26c8&amp;emdi=ea000000-0000-0000-0000-000000000001&amp;ceid=\" target=\"_blank\" rel=\"nofollow\">contact the Board and Governor Stitt right now and tell them you want justice for Julius.</a> Then share this link with your friends and family and encourage them to do the same.</p>\n<p>Thank you so much for your support,</p>\n<p>Sincerely,</p>\n<p>Rev. Cece Jones-Davis</p>\n<p>P.S. If you’re in Oklahoma, please join us, if you can, at 8am CT at Tabernacle Baptist Church in Oklahoma City on Monday to rally and march ahead of the hearing. For those not in Oklahoma, we’ll be going live on Instagram during the activities—<a href=\"https://www.instagram.com/justiceforjulius/?p2asource=em_20211029-ct-RJT-jjscotusupdate-actives&amp;emci=6f5ca2d7-4438-ec11-9820-c896653b26c8&amp;emdi=ea000000-0000-0000-0000-000000000001&amp;ceid=\" target=\"_blank\" rel=\"nofollow\">so be sure to follow along.</a></p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29770197", "createdAt": "2021-10-26T21:18:15.000Z", "title": "Julius’ clemency hearing has been postponed", "description": "<p>We are disappointed to report that Julius’ clemency hearing has been postponed until November 1. Julius has been waiting 20+ years for justice, and each delay is extremely frustrating.</p>\n<p>Today we held a vigil at Tabernacle Baptist to show our support for Julius, and keep up the pressure. We now have one additional week to win clemency for Julius – let’s use it well.</p>\n<p>We’ll follow up soon with more actions you can take. For now, thank you for sticking with us on this journey.</p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226041195", "petitionMedium": {"url": "//assets.change.org/photos/0/fr/fw/HvfRFwsJbXSVfJm-800x450-noPad.jpg?1635283099", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29763674", "createdAt": "2021-10-25T13:46:20.000Z", "title": "24 Hours: Innocent man could be executed", "description": "<p>Julius Jones’ clemency hearing is tomorrow. We have one day to convince Governor Stitt to free innocent Julius Jones.</p>\n<p><strong><a href=\"https://p2a.co/c7tcc4k\" target=\"_blank\" rel=\"nofollow\">We only have 24 hours. Can you email Governor Stitt and urge him to free Julius Jones?</a></strong></p>\n<p>Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, Julius’ execution is still scheduled for November 18. Tomorrow’s clemency hearing is his best chance.</p>\n<p><strong>Julius is innocent. We have 24 hours.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226037046", "petitionMedium": {"url": "//assets.change.org/photos/9/kc/cv/FOkcCvdnCAsrDNU-800x450-noPad.jpg?1635169582", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29760579", "createdAt": "2021-10-24T16:55:14.000Z", "title": "2 Days: Julius on the governor’s facebook", "description": "<p>We only have 2 days to convince Governor Stitt to free Julius Jones, an innocent man on death row.</p>\n<p><a href=\"https://www.facebook.com/GovStitt/posts/421646612651790\" target=\"_blank\" rel=\"nofollow\"><strong>Will you comment #JusticeforJulius on Governor Stitt’s most recent Facebook post? We have 2 days to convince the governor to make the right decision.</strong></a></p>\n<p>On October 26th, Governor Stitt will decide Julius Jones’ fate. Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, his execution is still scheduled for November 18.</p>\n<p><strong>Julius is innocent. Help us free Julius.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226034770", "petitionMedium": {"url": "//assets.change.org/photos/1/rg/at/VsRGAtppgtLKPLa-800x450-noPad.jpg?1635094515", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29757350", "createdAt": "2021-10-23T16:19:20.000Z", "title": "3 Days: Convince the governor now", "description": "<p>In 3 days, Governor Stitt will decide the fate of Julius Jones: an innocent man on death row.</p>\n<p><a href=\"https://drive.google.com/drive/folders/1AcQ8GuAJDTr8VhP4tOAcmw44AEX30aTW\" target=\"_blank\" rel=\"nofollow\"><strong>Will you post this graphic to Facebook and tag @justice4juliusjones? We have just a couple of days to get Julius’ story out there.</strong></a></p>\n<p>Julius Jones’ clemency hearing is in just 3 days. Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, his execution is still scheduled for November 18.</p>\n<p><strong>This hearing could be his best chance. Help us free Julius.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226032668", "petitionMedium": {"url": "//assets.change.org/photos/6/fu/ey/hpfUeyAArCkZhYS-800x450-noPad.jpg?1635005963", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29753311", "createdAt": "2021-10-22T14:59:08.000Z", "title": "4 Days: Free Julius Jones", "description": "<p>Julius Jones’ clemency hearing is in 4 days.</p>\n<p><strong><a href=\"https://p2a.co/bgmivzn\" target=\"_blank\" rel=\"nofollow\">Can you take a second to email Governor Stitt? We only have 4 days to convince him to free Julius.</a></strong></p>\n<p>This week, Governor Stitt will decide Julius Jones’ fate. Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, his execution is still scheduled for November 18.</p>\n<p><strong>Julius’ clemency hearing is in 4 days. Help us free Julius.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Represent Justice", "photoUrl": "https://p2a-images.s3.amazonaws.com/production/campaigns/105980/iIdXTZzAldX9CmYqzvKT6FhUJM3526png", "description": "I just wrote Oklahoma Governor Stitt, urging him to spare Julius Jones' life, an innocent man on death row for a crime he did not commit. Click to do the same: [@campaign]"}}, {"__typename": "StarterPetitionUpdate", "id": "29749203", "createdAt": "2021-10-21T16:22:42.000Z", "title": "5 days: #JusticeforJulius on Twitter", "description": "<p>We only have 5 days to convince Governor Stitt to free Julius Jones, an innocent man on death row.</p>\n<p><a href=\"https://twitter.com/GovStitt/status/1450539306657931271\" target=\"_blank\" rel=\"nofollow\"><strong>Would you comment #JusticeforJulius on Governor Stitt’s recent tweet? We have just a few days to convince him to free Julius.</strong></a></p>\n<p>On October 26th, Governor Stitt will decide Julius Jones’ fate. Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, his execution is still scheduled for November 18.</p>\n<p><strong>Julius is innocent. Help us free Julius.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226027581", "petitionMedium": {"url": "//assets.change.org/photos/7/eu/ff/zieuFfTXPcfeagW-800x450-noPad.jpg?1634833364", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29739853", "createdAt": "2021-10-19T15:40:56.000Z", "title": "7 days: Teach them about Julius", "description": "<p>Our friends at @impact on Instagram just created this post about Julius’ case. We need to make sure that as many people see it as possible.</p>\n<p><a href=\"https://www.instagram.com/p/CVNrP1nlwEP/\" target=\"_blank\" rel=\"nofollow\"><strong>Can you take a second to share this Instagram post about Julius? The more people who see it, the better his chances.</strong></a></p>\n<p>In just 7 days, Governor Stitt will decide Julius Jones’ fate. Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, his execution is still scheduled for November 18.</p>\n<p><strong>Julius’ clemency hearing is in 7 days. This is his best chance.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226021947", "petitionMedium": {"url": "//assets.change.org/photos/5/pt/vf/PUPTvflmlXFKegB-800x450-noPad.jpg?1634658059", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29735597", "createdAt": "2021-10-18T15:41:00.000Z", "title": "You're invited: national prayer call for Julius Jones", "description": "<p>It's a rough time for Julius Jones, his family and all of us who are advocating for his freedom. On September 13th, the Oklahoma Pardon and Parole Board voted 3-1 to recommend that Julius' sentence be commuted to life with the possibility of parole, yet the Court of Criminal Appeals issued a November 18th execution date just 7 days later. As Julius sits on DEATH WATCH today, we need your continued support now more than ever!</p>\n<p>Please join Pastor John Gray, Values Partnerships, and the Justice for Julius Campaign this Thursday, October 21st at 6:30pmCT/7:30pmET for a critical update on Julius Jones and what you can do. We also need you to share this invitation with your networks as soon as possible! All are welcome and can register here to receive the event link: <a href=\"https://bit.ly/Juliusfaithcall\" target=\"_blank\" rel=\"nofollow\">https://bit.ly/Juliusfaithcall</a></p>\n<p>Sincerely,</p>\n<p>Rev. Cece Jones-Davis</p>", "photo": {"id": "226019111", "petitionMedium": {"url": "//assets.change.org/photos/2/ac/nc/GGacnCODTmtIorj-800x450-noPad.jpg?1634571662", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29735564", "createdAt": "2021-10-18T15:32:39.000Z", "title": "8 days: We’re tweeting the governor", "description": "<p>In 8 days, Governor Stitt will decide the fate of Julius Jones, an innocent man on death row.</p>\n<p><a href=\"https://twitter.com/intent/tweet?text=.%40GovStitt%20Oklahoma%20cannot%20execute%20an%20innocent%20man.%20Please%20save%20the%20life%20of%20Julius%20Jones.\" target=\"_blank\" rel=\"nofollow\"><strong>Will you support Julius by tweeting Governor Stitt? We need to get his attention before it’s too late.</strong></a></p>\n<p>Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, his execution is still scheduled for November 18. We must act now.</p>\n<p><strong>We have 8 days to set Julius free.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226019091", "petitionMedium": {"url": "//assets.change.org/photos/4/ae/py/hPaEPyTuQmLnWbS-800x450-noPad.jpg?1634571163", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29729625", "createdAt": "2021-10-16T18:38:27.000Z", "title": "10 days: Tell the governor about Julius", "description": "<p>Julius Jones’ clemency hearing is in 10 days. We have 10 days to convince Governor Stitt to free Julius Jones – who is innocent – from prison.</p>\n<p><strong><a href=\"https://p2a.co/c7tcc4k\" target=\"_blank\" rel=\"nofollow\">Can you email Governor Stitt to urge him to free Julius? We don't have much time.</a></strong></p>\n<p>Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, Julius’ execution is still scheduled for November 18.</p>\n<p><strong>This clemency hearing is Julius’ best chance. With your help, we can free Julius.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Represent Justice", "photoUrl": "https://p2a-images.s3.amazonaws.com/production/campaigns/105980/iIdXTZzAldX9CmYqzvKT6FhUJM3526png", "description": "I just wrote Oklahoma Governor Stitt, urging him to commute Julius Jones' sentence, an innocent man on death row for a crime he did not commit. Click to do the same: [@campaign]"}}, {"__typename": "StarterPetitionUpdate", "id": "29726635", "createdAt": "2021-10-15T18:44:02.000Z", "title": "11 days: Urgent action for Julius", "description": "<p>Julius’ clemency hearing is in 11 days. We have just 11 days to convince Governor Stitt to free an innocent man from prison.</p>\n<p><a href=\"https://p2a.co/b8JuoUe\" target=\"_blank\" rel=\"nofollow\"><strong>Can you spare 1 minute to call the governor? This clemency hearing is Julius’ best chance.</strong></a></p>\n<p>Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, Julius’ execution is still scheduled for November 18. We must act now.</p>\n<p><strong>With your help, we can free Julius.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Change.org", "photoUrl": "https://p2a-images.s3.amazonaws.com/production/customers/2423/qcRI4KM1L0objRO39jAq15913795866306", "description": "I just called Oklahoma Gov. Stitt to demand clemency for Julius Jones. Will you speak up for an innocent man? Change.org/JusticeForJulius"}}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjIz", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13534925", "slug": "julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma", "user": {"id": "898371250", "displayName": "Cece Jones-Davis #FreeJuliusJones", "photo": {"id": "223801661", "userSmall": {"url": "//assets.change.org/photos/2/cp/fd/YIcPfDVlWUSGPdg-48x48-noPad.jpg?1589988094", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "29722330", "createdAt": "2021-10-14T18:06:11.000Z", "title": "12 days: Share this for Julius", "description": "<p>Our friends at @so.informed on Instagram just created this post about Julius’ case. We need to make sure that as many people see it as possible.</p>\n<p><a href=\"https://www.instagram.com/p/CU-EVSxrFWR/\" target=\"_blank\" rel=\"nofollow\"><strong>Can you take a second to share this Instagram post about Julius? The more people who see it, the better his chances.</strong></a></p>\n<p>In 12 days, the Oklahoma Pardon and Parole Board will make a recommendation to Governor Stitt that will help decide Julius Jones’ fate. Despite their previous recommendation that the Governor commute Julius’ sentence, his execution is still scheduled for November 18.</p>\n<p><strong>Julius’ clemency hearing is in 12 days. This is his best chance.</strong></p>\n<p>– Team Justice for Julius</p>", "photo": {"id": "226010691", "petitionMedium": {"url": "//assets.change.org/photos/8/yl/gn/aeYLGNZGDZRPXHW-800x450-noPad.jpg?1634234775", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29699081", "createdAt": "2021-10-08T14:22:30.000Z", "title": "18 days to convince the governor", "description": "<p>In 18 days, Governor Stitt will decide Julius Jones’ fate. Despite the Parole Board’s recommendation that the Governor commute Julius’ sentence, his execution is still scheduled for November 18.</p>\n<p><strong>This clemency hearing is Julius’ last chance.</strong></p>\n<p>We’ve got a plan. For the next two weeks, we will be sending you quick action items to get Governor Stitt’s attention. We know that your outreach makes a difference, so we need you to commit just a small amount of your time over the next few weeks to help us save an innocent man’s life.</p>\n<p><strong><a href=\"https://p2a.co/b8JuoUe\" target=\"_blank\" rel=\"nofollow\">Can you spare 1 minute to call the office of Governor Stitt?</a></strong></p>\n<p>– Team Justice for Julius</p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Change.org", "photoUrl": "https://p2a-images.s3.amazonaws.com/production/customers/2423/qcRI4KM1L0objRO39jAq15913795866306?v=863190188", "description": "I just called Oklahoma Gov. Stitt to demand clemency for Julius Jones. Will you speak up for an innocent man? Change.org/JusticeForJulius"}}, {"__typename": "StarterPetitionUpdate", "id": "29627909", "createdAt": "2021-09-20T19:54:23.000Z", "title": "Julius now has an execution date", "description": "<p>Today we learned that the Oklahoma Court of Criminal Appeals has assigned Julius Jones a November 18 execution date, even though the Pardon and Parole Board voted 3-1 to recommend his sentence be commuted.</p>\n<p>We can't let this happen. We need everyone to take action today to encourage Gov. Kevin Stitt to approve the Parole Board's recommendation before it's too late. Please, lend your voice to the fight to save Julius' life.<br> <br>Here’s what you can do to help:</p>\n<p>TAKE ACTION - <a href=\"https://p2a.co/c7tcc4k\" target=\"_blank\" rel=\"nofollow\">Contact Governor Stitt and ask him to act urgently to accept the Pardon and Parole Board's recommendation. </a><br>DONATE - <a href=\"https://www.representjustice.org/justice-for-julius-donate-today-2/\" target=\"_blank\" rel=\"nofollow\">to support our ongoing efforts to demand Justice for Julius</a><br>SHARE - your support and ask others to take action for #JusticeforJulius <a href=\"https://www.justiceforjuliusjones.com/action\" target=\"_blank\" rel=\"nofollow\">https://www.justiceforjuliusjones.com/action</a></p>\n<p>Thank you!</p>\n<p>Rev. Cece Jones-Davis</p>", "photo": {"id": "225950822", "petitionMedium": {"url": "//assets.change.org/photos/7/tw/sf/HATwsFAtTDgHRJA-800x450-noPad.jpg?1632167667", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29616699", "createdAt": "2021-09-17T19:36:57.000Z", "title": "The fight to save Julius Jones' life is not over", "description": "<p>It's been incredible to see the outpouring of support these last few weeks - THANK YOU. Because of your efforts, the Oklahoma Pardon and Parole Board heard Julius Jones’ case this week and voted 3-1 to commute his sentence and take him off death row.  <br> <br>But the fight is not over – now we need Governor Kevin Stitt to approve the Board’s recommendation and officially grant Julius a commutation (this is URGENT – if Gov. Stitt rejects the Board’s decision, Julius will face execution later this year). <br> <br>Here’s what you can do to help:</p>\n<p>TAKE ACTION - <a href=\"https://p2a.co/txfmrtn\" target=\"_blank\" rel=\"nofollow\">Contact Governor Stitt and ask him to act urgently to accept the Pardon and Parole Board's recommendation. </a><br>DONATE - <a href=\"https://www.representjustice.org/justice-for-julius-donate-today-2/\" target=\"_blank\" rel=\"nofollow\">to support our ongoing efforts to demand Justice for Julius</a><br>SHARE - your support and ask others to take action for #JusticeforJulius <a href=\"https://www.justiceforjuliusjones.com/action\" target=\"_blank\" rel=\"nofollow\">https://www.justiceforjuliusjones.com/action</a></p>\n<p>Thank you!</p>\n<p>Rev. Cece Jones-Davis</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29524244", "createdAt": "2021-08-27T17:19:13.000Z", "title": "Julius could be executed on 10/28 if we don't act", "description": "<p><strong>Earlier this week, Oklahoma’s attorney general requested an October 28 execution date for Julius Jones. </strong></p>\n<p>This occurred despite Julius having a commutation hearing scheduled for September 13th to present the mounting evidence that proves his innocence.</p>\n<p>It is truly shocking—and, quite frankly, outrageous and cruel—that the promise of a fair hearing, which former AG Mike Hunter agreed Julius has a right to, might now be short-circuited because of this rush to resume executions. </p>\n<p><a href=\"https://p2a.co/VFxT3rJ\" target=\"_blank\" rel=\"nofollow\">So today, I need every single person who signed this petition to contact the Oklahoma Pardon &amp; Parole Board and demand that they keep Julius’ September 13th commutation hearing.</a> This fight has never been more urgent. Julius’ life is quite literally on the line and we need as many people as possible to make their voices heard.</p>\n<p>Thanks,</p>\n<p>Rev. Cece Jones-Davis</p>\n<p>Justice for Julius</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29458544", "createdAt": "2021-08-13T18:46:42.000Z", "title": "One month to save Julius Jones", "description": "<p>For over 20 years, Julius Jones has been on death row in Oklahoma for a crime another man has reportedly confessed to committing. But in one month, that could change.</p>\n<p>On September 13th, Julius will have a commutation hearing in front of the Oklahoma Pardon &amp; Parole Board. He’s exhausted all of his court appeals, so this really is his last shot at justice.</p>\n<p>Over the next month, we need to do everything we can to help Julius get the freedom he deserves. So today, <a href=\"https://www.votervoice.net/mobile/OKCATHOLIC/Campaigns/86855/Respond?p2asource=em_20210813-ct-CJD-onemonthout-actives&amp;ms=em_20210813-ct-CJD-onemonthout-actives&amp;emci=01fe855e-b6fa-eb11-b563-501ac57b8fa7&amp;emdi=ea000000-0000-0000-0000-000000000001&amp;ceid=\" target=\"_blank\" rel=\"nofollow\">I’m asking you to contact the Pardon &amp; Parole Board and tell them you support Julius’ fight for justice.</a></p>\n<p>Look, when I started the Justice for Julius petition on Change.org, I never thought it would turn into a much larger movement. More than six million people have signed the petition and over 50,000 letters have been sent to the Oklahoma Pardon and Parole Board—all in an effort to free Julius.</p>\n<p>But we can’t let up now. We have to keep this momentum going as we head into the final month of this fight.</p>\n<p><a href=\"https://www.votervoice.net/mobile/OKCATHOLIC/Campaigns/86855/Respond?p2asource=em_20210813-ct-CJD-onemonthout-actives&amp;ms=em_20210813-ct-CJD-onemonthout-actives&amp;emci=01fe855e-b6fa-eb11-b563-501ac57b8fa7&amp;emdi=ea000000-0000-0000-0000-000000000001&amp;ceid=\" target=\"_blank\" rel=\"nofollow\">So if you believe that Julius deserves freedom after 20 years of wrongful incarceration, then please, take a moment to contact the Oklahoma Pardon &amp; Parole board and tell them it’s time for justice.</a></p>\n<p>Thanks, and more soon.</p>\n<p>Cece Jones-Davis</p>", "photo": {"id": "225843475", "petitionMedium": {"url": "//assets.change.org/photos/1/oj/zd/fOOjZdAiCadnPDu-800x450-noPad.jpg?1628880407", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "29183530", "createdAt": "2021-06-09T17:46:55.000Z", "title": "Join us Friday for the live Justice for Julius Campaign Update", "description": "<p><em>A message from Julius Jones' sister, Antoinette Jones:</em></p>\n<p>For the past 21 years, my brother Julius Jones has been on death row in Oklahoma for a murder he did not commit. He was at home eating dinner with our family at the time of the crime. But the truth was no match for racial discrimination in our justice system and a shoddy legal defense, and my innocent big brother was sentenced to death.</p>\n<p>It’s been more than two decades since I’ve been able to give Julius a hug—but thanks to organizations like Represent Justice that are giving my brother’s case a platform, I am so hopeful that we can finally get him out. In this fight to bring him home to us, every minute counts.</p>\n<p>This Friday, June 11 at 11 a.m. CT, Represent Justice and the Justice for Julius campaign are hosting a live campaign update about the next steps we'll take to help my brother. We’ll be joined by more members of the Jones family, Julius' legal team, and faith and community leaders. <a href=\"https://www.facebook.com/events/502563524417850/?emci=30fa9ef2-8cc8-eb11-a7ad-501ac57b8fa7&amp;emdi=ea000000-0000-0000-0000-000000000001&amp;ceid=\" target=\"_blank\" rel=\"nofollow\">It will all be streamed on the Represent Justice Facebook page, and I’d love for you to join—will you RSVP now?</a></p>\n<p>Building awareness for my brother’s case this summer is crucial because he has a commutation (lessening his sentence or even releasing him on time served) hearing on September 13th that could save his life—and because he’s exhausted all of his appeals, this is his last chance at freedom.</p>\n<p>But despite everything, Julius, myself, and our family are keeping hope in our hearts. More than six million people have signed a petition calling for justice, and thousands have written the Oklahoma Pardon and Parole Board on behalf of my brother. And now, athletes and celebrities are calling for justice for Julius. Knowing we’re not in this alone helps me get up every morning and continue the fight.</p>\n<p>I’m truly so grateful for all the support—but we can’t let up. So please, <a href=\"https://www.facebook.com/events/502563524417850/?emci=30fa9ef2-8cc8-eb11-a7ad-501ac57b8fa7&amp;emdi=ea000000-0000-0000-0000-000000000001&amp;ceid=\" target=\"_blank\" rel=\"nofollow\">join us for the Justice for Julius Campaign Update, live on Friday, June 11 at 11 a.m. CT on the Represent Justice Facebook page.</a></p>\n<p>Thank you for everything,</p>\n<p>Antoinette Jones</p>", "photo": {"id": "225651638", "petitionMedium": {"url": "//assets.change.org/photos/1/hx/iz/glHxIZtBSbJpQML-800x450-noPad.jpg?1623260817", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "28681805", "createdAt": "2021-03-10T01:48:14.000Z", "title": "Our Prayers are Answered", "description": "<p>Earlier this week, our prayers for Julius Jones and his family were answered. In a 3-1 decision, the Oklahoma Pardon and Parole Board voted to grant Julius Jones a \"stage two\" commutation hearing, where he will be able to present the case for his innocence. </p>\n<p>As you may know, Julius' defense team recently shared <a href=\"https://www.youtube.com/watch?v=JLYzd1n5CzI\" rel=\"nofollow\">new evidence</a> of his innocence, including a sworn affidavit from a man who says that Jones’ codefendant, Christopher Jordan, confessed to the murder Jones is on death row for (<a href=\"https://www.youtube.com/watch?v=JLYzd1n5CzI\" rel=\"nofollow\">watch this video for more information</a>).</p>\n<p>We believe that compelling new evidence, combined with the tens of thousands of emails, calls and letters from people like you, helped to convince the Parole Board to do the right thing. We also know the fight to save Julius isn't over.</p>\n<p>In the next few months, we will need your help even more. Please <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">continue to write the Pardon and Parole Board</a>, so they know the world is watching their next decision. Share social media content like <a href=\"https://youtu.be/JLYzd1n5CzI\" rel=\"nofollow\">this video</a> that outlines the case for Julius' innocence. And, of course we need your prayers, encouragement and love while we work together to take on a system that is committed to carrying out this execution regardless of Julius' innocence or the evidence in his favor. <br> </p>\n<p>Earlier this week, Julius' sister Antoinette had this to say to the media: <em>\"My family knows Julius is not guilty because we were with Julius at our house when the murder occurred. We never got to tell that story, and the truth about Julius has been buried for a long time. Now, finally, that truth may come out.”</em></p>\n<p>I am heartbroken for Antoinette and her family, who have been through so much. But I am also encouraged and inspired by their resolve and I am committed to making sure that the truth does indeed see the light of day. I know you are too. Together, we will ensure the truth comes out because we know the truth will set Julius for free. </p>\n<p>Sincerely,<br> <br>Rev. Cece Jones-Davis<br>Julius Jones Coalition</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "28618296", "createdAt": "2021-02-26T16:58:29.000Z", "title": "We Delivered 6.2 million signatures to the Pardon and Parole Board!", "description": "<p>Dear Friends,</p>\n<p>Yesterday over 100 advocates for Julius Jones gathered at Wesley United Methodist Church in Oklahoma City to pray, then walked just a few blocks to the Oklahoma Pardon and Parole Board Office.  </p>\n<p>There, we delivered over 6.2 million of YOUR signatures to Mr. Tom Bates, executive director of the board. <strong>On March 8th, the parole board plans to review Julius’ commutation application and vote whether or not to give him a hearing later in the year.</strong> We believe the thousands of calls, letters and prayers from people like you have made a huge difference in ensuring Julius gets this final chance for freedom.</p>\n<p>If you haven't done so yet (and even if you have!), please be sure to <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">write the Oklahoma Pardon and Parole Board</a> and Governor Kevin Stitt <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">through our website</a> and ask them to commute Julius' sentence. </p>\n<p>Regarding yesterday’s rally, I’d like to extend my deepest gratitude to Rev. Adam Shahan and the Wesley United Methodist Church family for their generous hospitality. To Pastor Amy Little, Taylor Cockrell, Rev. Shannon Fleck, Rev. J.A. Reed, Rev. James Olson, Rev. Sean Jarrett, Pastor Jonathan Martin and Montrae Tisdale-Johnson and the Friends Chorale: your ministry at our rally encouraged our hearts and gave us fuel to keep moving forward. Thank you!</p>\n<p>The struggle to save Julius is far from over. We have another very important event coming up next week!  On Tuesday, March 2nd at 6pmCT/7pmET, Bishop T.D. Jakes will host a national faith call to discuss Justice for Julius advocacy.  He has written a passionate letter of support to the Oklahoma Pardon and Parole Board and to Governor Kevin Stitt on Julius’ behalf already, and we look forward to this powerful brainstorm with leaders from around the country. You do not want to miss this!<br> <br><a href=\"https://us02web.zoom.us/webinar/register/WN_YncCK4UTSP2gWn3SuWI3MA\" rel=\"nofollow\">Click here</a> to register now, and be sure to share this information and link!<br>  <br>It’s an indescribable feeling knowing that millions of people have created a human chain to save the life of Julius Jones. I am so grateful to know that good always triumphs over evil. Always. <br> <br>Let’s keep the faith and make sure that the intensity of our words and deeds on behalf of Julius match our prayers and conviction.<br> <br>Sincerely,<br> <br>Rev. Cece Jones-Davis<br>Julius Jones Coalition</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "28149822", "createdAt": "2020-12-01T14:49:34.000Z", "title": "Help Save Julius' Life on #GivingTuesday", "description": "<p>Last week, while many of us celebrated with friends and family, Julius Jones spent Thanksgiving in a cell waiting an execution date from the state of Oklahoma for a crime he did not commit. It was the twenty-first Thanksgiving he has spent on death row. <br> <br>Despite this injustice, Julius wants you to know he has a lot to be thankful for. He is thankful for God, Who continues to fill him with hope.  He is thankful for his family and friends, who never lost faith in him. And, he is thankful for men and women like you, who took the time to learn about his case and to advocate for his release. </p>\n<p>With Oklahoma on the verge of restarting executions, next year will be the year that Julius is either executed or granted clemency. In the last year, our efforts have put unprecedented pressure on Oklahoma’s criminal justice system to reconsider Julius’ case. We have helped deliver thousands of emails to the Oklahoma Pardon and Parole Board and Governor Kevin Stitt’s office, connected influential voices like Kim Kardashian West and Baker Mayfield with the #JusticeforJulius campaign, and dramatically raised the profile of Julius’ case. <br> <br>We need to continue that work and get Julius across the finish line. But to do that, we need your help. Our advocacy efforts to keep the pressure on require purchasing supplies, running a website, and more. Please, this Giving Tuesday, <a href=\"https://secure.everyaction.com/ftTpfmbF9UiPJV6Cc19Yrg2\" rel=\"nofollow\">make a contribution</a> that will help save Julius’ life. <a href=\"https://secure.everyaction.com/ftTpfmbF9UiPJV6Cc19Yrg2\" rel=\"nofollow\">Donate today</a> and know that your support will go directly to the campaign to end this injustice and ensure Julius spends the next Thanksgiving at home with his family. <br> <br><a href=\"https://secure.everyaction.com/ftTpfmbF9UiPJV6Cc19Yrg2\" rel=\"nofollow\">Click here to make a donation now.</a> Justice requires all of us!</p>", "photo": {"id": "224923364", "petitionMedium": {"url": "//assets.change.org/photos/6/ln/yn/yKLNyNfzbygYWmi-800x450-noPad.jpg?1606834176", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "28118453", "createdAt": "2020-11-24T22:01:46.000Z", "title": "Kim Kardashian West Visits Julius Jones", "description": "<p>If you didn’t already see it on social media or in the news, we have an exciting development to share with you: yesterday, Kim Kardashian-West visited Julius Jones in prison and met with his parents to offer him hope and continued support (read more about her visit <a href=\"https://pagesix.com/2020/11/24/kim-kardashian-visits-oklahoma-inmate-on-death-row-julius-jones/\" rel=\"nofollow\">here</a>). Since that visit, and thanks to Kim’s relentless advocacy, we’ve already seen thousands of people around the world take action through our website and write the Oklahoma Pardon and Parole Board an email of support for Julius (you can <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">click here</a> to write an email yourself).</p>\n<p>We believe strongly that the effort to commute Julius’ sentence is gaining momentum every day. Now we need your help to ensure we continue to make progress. Please consider donating to the #justiceforjulius campaign <a href=\"https://secure.everyaction.com/ftTpfmbF9UiPJV6Cc19Yrg2\" rel=\"nofollow\">here</a>. Your dollars will contribute directly to the effort to save Julius’ life (our campaign needs support to buy rally-signs, t-shirts, and to support public relations outreach). Your support will help us save the life of this innocent man.</p>", "photo": {"id": "224901573", "petitionMedium": {"url": "//assets.change.org/photos/6/eg/cj/oUeGcjxKJLoaIBA-800x450-noPad.jpg?1606255309", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "28099153", "createdAt": "2020-11-20T21:50:33.000Z", "title": "Support Our Effort to Save Julius", "description": "<p>This year has been difficult for all of us, yet we’ve found a way to continue helping others in important ways. For us, that means pushing forward with our effort to save Julius Jones, an innocent man on Oklahoma’s death row.  Because of these efforts, and with the support of people like you, Julius’ story has now reached tens of millions of people across the country and even the world.</p>\n<p>The fight is not over yet, and Julius’ life still hangs in the balance. As the team strategically plans for 2021, we will need your support like never before. It has been 13 months since Julius filed for commutation with the Oklahoma Pardon and Parole Board. He still has not heard anything from them, and every day brings him closer to an execution date. </p>\n<p>With the clock ticking, we must ramp up our energy and efforts for 2021! You can help by regularly donating to the #justiceforjulius campaign <a href=\"https://secure.everyaction.com/ftTpfmbF9UiPJV6Cc19Yrg2\" rel=\"nofollow\">here.</a> Your dollars will contribute directly to the effort to save Julius’ life (our campaign needs support to buy rally-signs, t-shirts, and to support public relations outreach). </p>\n<p>Please consider <a href=\"https://secure.everyaction.com/ftTpfmbF9UiPJV6Cc19Yrg2\" rel=\"nofollow\">donating today</a> and help us save the life of this innocent man.</p>\n<p><em>Note: The #JusticeforJulius campaign is supported by <a href=\"https://www.representjustice.org/\" rel=\"nofollow\">Represent Justice,</a> a 501(c)3 non-profit organization working for structural change to the justice system. EIN: 83-1501685</em></p>", "photo": {"id": "224887842", "petitionMedium": {"url": "//assets.change.org/photos/3/jy/rk/peJYrkUlshannKk-800x450-noPad.jpg?1605909034", "processing": false}}, "video": null, "embeddedMedia": null}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjM1", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13534925", "slug": "julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma", "user": {"id": "898371250", "displayName": "Cece Jones-Davis #FreeJuliusJones", "photo": {"id": "223801661", "userSmall": {"url": "//assets.change.org/photos/2/cp/fd/YIcPfDVlWUSGPdg-48x48-noPad.jpg?1589988094", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "27930535", "createdAt": "2020-10-21T20:32:37.000Z", "title": "For Exonerees, \"The Sun Does Shine\"", "description": "<p>This Friday at 6 PM CST we hope you can join us for a very special <a href=\"https://www.facebook.com/justice4juliusjones\" rel=\"nofollow\">Facebook Live</a> conversation with Anthony Ray Hinton. Anthony was wrongfully accused of murdering two fast-food restaurant managers and served 28 years on death row in Alabama before his exoneration. He was played by O’Shea Jackson Jr. in the film “Just Mercy.” The film, starring Michael B. Jordan and Jamie Foxx, follows attorney Brian Stevenson as he fights for the wrongly imprisoned — including Hinton.</p>\n<p>Anthony’s case parallels Julius’ in so many ways. He was represented by an inexperienced, overwhelmed and underprepared public defender. He was convicted despite having a strong alibi (Hinton’s boss says he was at work when the murders took place; Julius’ parents say he was at home). In both cases, the state’s charges rested largely on “junk” forensic science that has since been disproven.</p>\n<p>Most importantly, they are similar in the ways that the system was designed to protect itself, even in the face of obvious errors. The problems with Anthony’s case were so glaring that when he was finally granted a retrial by the U.S. Supreme Court, a new judge dismissed all charges and let him go free. For decades before that, however, the system ignored new evidence, swept contradictory testimony under the rug, and worked to cover its tracks – at the expense of Anthony’s freedom.</p>\n<p>This Friday at 6 PM SCT, Anthony will join us <a href=\"https://www.facebook.com/justice4juliusjones\" rel=\"nofollow\">on Facebook</a> to share his thoughts on Julius Jones and what he learned from his long fight for justice. We hope you will <a href=\"https://www.facebook.com/justice4juliusjones\" rel=\"nofollow\">join us</a> and, while you’re at it, <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">write an email</a> of support to the Oklahoma Pardon and Parole Board and Governor Kevin Stitt.</p>\n<p>When Anthony was released from prison, one of the first thing he said to reporters and the public was “The sun does shine.” It is our greatest hope that through our activism and advocacy, Julius can have his own moment in the sun, as a free man, with his family.</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27890205", "createdAt": "2020-10-14T18:52:39.000Z", "title": "One More Year Without Justice", "description": "<p>Tomorrow marks one year since Julius Jones filed his commutation application with the Oklahoma Pardon and Parole Board. A commutation hearing – where Julius can tell his side of the story and present the evidence of his innocence – is Julius’ best hope of getting off of death row.</p>\n<p>Julius spends 23 hours a day alone in his cell and has now served over 21 years behind bars for a crime he didn’t commit. His only way of communicating with the outside world and telling his story is through people like YOU.</p>\n<p>That’s why tomorrow we are asking all of Julius’ supporters to take the following three steps on the one-year anniversary of Julius’ commutation application being filed:</p>\n<p>·      Post a graphic and a message from this <a href=\"https://drive.google.com/drive/folders/15KHNH2qy4n9_fk7x2pwKPybKR0ISkkB_\" rel=\"nofollow\">social media toolkit</a> to raise awareness of his case (use the #justiceforjulius hashtag);</p>\n<p>·      Circulate the <a href=\"https://www.change.org/p/julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma\" rel=\"nofollow\">Change.org petition</a> to save Julius’ life; help us get to 7 million signatures!</p>\n<p>·      <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">Email the Pardon and Parole Board</a> and Gov. Kevin Stitt to request a commutation hearing for Julius.</p>\n<p>We also invite you to join us at 6 PM CST tomorrow on our <a href=\"https://www.instagram.com/justiceforjulius/\" rel=\"nofollow\">Instagram page</a> to hear a LIVE conversation with Jimmy Lawson, Julius’ best friend, and Irv Roland, an activist and NBA trainer. They’ll share their thoughts on Julius, the criminal justice system, and what we can do to help right this terrible wrong.</p>\n<p>Thank you for your commitment to justice and to saving the life of this innocent man!</p>", "photo": {"id": "224716945", "petitionMedium": {"url": "//assets.change.org/photos/5/rg/ux/PiRguXPtKrRfkCA-800x450-noPad.jpg?1602701561", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27739939", "createdAt": "2020-09-17T18:18:04.000Z", "title": "Baker Mayfield Takes the Field for #JusticeforJulius", "description": "<p>As the effort to saves Julius Jones from an unjust death sentence for a crime he did not commit continues, we have been overwhelmed by the support we have received from people all across the country. That includes over 6 million signatures on our Change.org petition as well as over 16,000 letters sent to the Oklahoma Pardon and Parole Board and Governor Kevin Stitt (if you haven’t sent a letter yet, please do so <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">here</a>!).</p>\n<p>It has also included the support of several high-profile celebrities and athletes who have chosen to use their platform and fame as tools to fight injustice. The latest is Cleveland Browns Quarterback (and former University of Oklahoma sensation and Heisman trophy winner) Baker Mayfield. Baker has made the decision to wear Julius’ name on the back of his helmet this season and to use his post-game press conferences to speak out on Julius’ behalf. We want to offer our sincere thanks to him for his leadership and his fearlessness.</p>\n<p>In fact, Julius was so moved by Baker’s actions that he has asked us to share the message below:</p>\n<p><em>“Thank you to Baker Mayfield, who has spoken on issues of inequality, criminal justice and race, and  had the courage to speak up for me.  I know that advocating for someone in my position can be difficult, but Baker did it anyway because he felt called to take a stand.  I am thankful to Baker and the many who are lending their voices and their prayers to my family and me as we work to correct this injustice.”</em> - Julius Jones  </p>\n<p>Standing up for what’s right isn’t always easy, and we are so grateful that people are willing to put their names and reputations on the line for this cause.</p>\n<p>Lastly, make sure to <a href=\"https://www.facebook.com/justice4juliusjones\" rel=\"nofollow\">tune-in</a> to our Facebook Live Friday tomorrow (9/18) night at 6PM CST. We will be hearing from, Nancy Vollertsen, whose brother Greg spent five years on Oklahoma's death row for the brutal murder of his wife before being exonerated. Like Julius, Nancy’s brother spent 23 hours a day in a cell by himself while waiting to be executed. He was eventually released from prison without so much as an apology from the state. <a href=\"https://www.facebook.com/justice4juliusjones\" rel=\"nofollow\">Join us</a> tomorrow to hear Nancy’s story and why she’s now fighting for Julius’ life and his release from prison.</p>", "photo": {"id": "224603653", "petitionMedium": {"url": "//assets.change.org/photos/5/sr/ea/PisrEaZaPGagCRX-800x450-noPad.jpg?1600366685", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27703538", "createdAt": "2020-09-11T18:46:14.000Z", "title": "Wrongfully Convicted Fernando Bermudez Speaks Out for Julius Jones", "description": "<p>As part of Justice for Julius' recently launched “Facebook Live Fridays,” we are hosting a guest at 6PM CST every Friday on our <a href=\"https://www.facebook.com/justice4juliusjones\" rel=\"nofollow\">Facebook page</a> who can share their unique perspective on Julius’ case and why they are working to see him set free.  </p>\n<p>Last week we heard from Jennifer Thompson, author of “Picking Cotton” and Board President for <a href=\"https://healingjusticeproject.org/\" rel=\"nofollow\">Healing Justice</a>. Jennifer has a unique perspective as the victim of a violent rape who wrongly identified her perpetrator, Ronald Cotton, who was imprisoned and later exonerated. We talked about what it’s like to navigate the criminal justice system as the victim of a terrible crime and how she came to terms with mistakenly identifying an innocent man. Jennifer has written Gov. Stitt on Julius’ behalf, and we greatly appreciated her sharing her story. If you missed our conversation, make sure to <a href=\"https://www.facebook.com/watch/?v=961579607644289&amp;extid=Aaul5WvD9NmfdEM9\" rel=\"nofollow\">check it out here.</a></p>\n<p>Today I am excited to announce that we will be talking to <a href=\"https://www.representjustice.org/speakers/fernando-bermudez/\" rel=\"nofollow\">Fernando Bermudez</a>, a man who spent 18 years in prison for a murder he did not commit before being exonerated and released. Fernando was proven innocent in late 2009 with help from pro bono attorneys in Washington, D.C., New Jersey and New York. Mr. Bermudez’s exoneration makes him the first Latin-American male in NY-state legal history exonerated on “actual innocence” grounds. The sole evidence against him involved mistaken and coerced eyewitness identification by five teenagers, who later recanted their testimony.</p>\n<p><a href=\"https://www.facebook.com/justice4juliusjones\" rel=\"nofollow\">Tune into our conversation TODAY at 6 PM CST.</a></p>\n<p>We’ll continue to host grant new guests each week and to talk about why so many people from so many different walks of life are working to bring Justice for Julius Jones in the form of his commutation and release from prison.</p>\n<p>As always, I encourage you to <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">write the Oklahoma Pardon and Parole Board through our website</a> and ask them to grant Julius clemency. We believe he will have a hearing in the next several months, and we need to make sure our voices are heard.</p>", "photo": {"id": "224576773", "petitionMedium": {"url": "//assets.change.org/photos/7/uy/et/YbuYeTjNVPobeWc-800x450-noPad.jpg?1599849976", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27647035", "createdAt": "2020-09-02T19:38:34.000Z", "title": "Rallies for Julius, More NBA Support, and More!", "description": "<p>As we continue the fight to bring Justice to Julius Jones and his family, we wanted to share some exciting news and updates with you.</p>\n<p>One the anniversary of Dr. Martin Luther King, Jr.’s “March for Justice,” Julius’ cause took center stage. Julius’ mother Madeline and his childhood friend Jimmy Lawson <a href=\"https://oklahoman.com/article/5670407/blm-marches-for-justice\" rel=\"nofollow\">both spoke at an Oklahoma City “March for Justice,”</a> while Black Lives Matter OKC members <a href=\"https://nondoc.com/2020/08/29/black-lives-matter-okc-rallies-for-julius-jones-at-washington-march/\" rel=\"nofollow\">travelled to Washington, DC</a> with large “Justice for Julius” banners to participate in a demonstration on the National Mall.</p>\n<p>Meanwhile, the NBA and its athletes with ties to Oklahoma continue to be incredible advocates for Julius. This week, the Oklahoma City Thunder’s Andre Roberson took the court with “Justice for Julius” written on his shoes after sending a letter to Governor Kevin Stitt asking for Julius’ sentence to be commuted (<a href=\"https://static1.squarespace.com/static/5d4df5acea4f970001e70135/t/5f4f96ad027b493e931c1dd8/1599051437442/Andre+Roberson+Letter_Signed____.pdf\" rel=\"nofollow\">read it here)</a>.</p>\n<p>Lastly, I was honored to join Jenna Hatmaker to discuss the fight to free Julius on her <a href=\"https://jenhatmaker.com/podcast/series-29/cece-jones-davis-realigning-the-gears-of-the-u-s-justice-system/\" rel=\"nofollow\">“For the Love Podcast”</a>. If you are unfamiliar with Jenna, she is the best-selling author of “For the Love” and “Of Mess and Moxie,” whose top-10 podcast has millions of followers. Her current podcast series – “For the Love of Black Lives” – focuses on coming together “to fight for the wholeness and dignity of Black children and adults in our country and across the world.” Please listen and share her podcast with friends and family!</p>\n<p>As always, I encourage you to <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">write the Oklahoma Pardon and Parole Board through our website</a> and ask them to grant Julius clemency. We believe he will have a hearing in the next several months, and we need to make sure our voices are heard.</p>\n<p>Thank you for your love, support and activism. We are united in the cause of saving this innocent man’s life and delivering justice!</p>", "photo": {"id": "224536120", "petitionMedium": {"url": "//assets.change.org/photos/8/hb/qv/PDhbQVpNwxtJjMt-800x450-noPad.jpg?1599075518", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27596893", "createdAt": "2020-08-26T02:32:18.000Z", "title": "Private Investigator Eric Cullen Weighs in On Julius' Case", "description": "<p>I have been able to communicate with Julius recently and he is elated and uplifted by the support he has gotten here in Oklahoma and all around the world. Our voices and our activism are making a difference, and we believe that the Oklahoma Pardon and Parole Board and Oklahoma Governor Kevin Stitt will have no choice but to hear us and do the right thing by commuting Julius’ sentence. Please consider taking a moment to send them an email asking for Julius’ sentence to be commuted through our coalition website by <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">clicking here.</a></p>\n<p>As we wait for a commutation hearing, we are continuing to shed light on Julius’ case and do everything we can to draw attention to his innocence. Last week, we were joined on Facebook by Tulsa-based Private Investigator Eric Cullen, who talked about why he has gotten involved in this case.</p>\n<p>Cullen worked for over 14 years to exonerate three Tulsa men who were wrongfully convicted of murder. He sees similarities between those cases and Julius, including “young, black men with limited resources” convicted after “shoddy, incomplete investigations” and “the testimony of questionable witnesses incentivized to lie for their own self-preservation.” In a letter to Governor Stitt and the Parole Board, Eric wrote: “Based on my extensive experience with these cases and a review of Julius’ case, I’m confident Julius is as innocent as these men, and he deserves his freedom.”     </p>\n<p>Please watch and share our Facebook Live conversation with friends and family <a href=\"https://www.facebook.com/justice4juliusjones/videos/328141464905660/\" rel=\"nofollow\">here!</a></p>", "photo": {"id": "224500048", "petitionMedium": {"url": "//assets.change.org/photos/9/tq/zn/TKTqZnirfwFWJoE-800x450-noPad.jpg?1598409141", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27538931", "createdAt": "2020-08-17T17:15:43.000Z", "title": "Justice for Julius Talks with OKC Rapper Jabee", "description": "<p>If you haven’t heard it yet, be sure to check out OKC rapper and activist’s new track, “Until You’re Free,” which features a recording from Julius from prison. The track is available on iTunes, Spotify and you can <a href=\"https://youtu.be/psKk2hP10Yo\" rel=\"nofollow\">stream it here on YouTube.</a></p>\n<p>I recently joined Jabee on Facebook Live to talk about the track, his friendship with Julius, and why he’s using his platform to raise awareness about this case. <a href=\"https://www.facebook.com/watch/live/?v=1986393174830029&amp;ref=watch_permalink\" rel=\"nofollow\">You can watch our conversation here.</a></p>\n<p>We continue to use social media to speak to hundreds of thousands – sometimes millions of people – about Julius every week. The support for this cause and the positive feedback has been overwhelming and we are so grateful to the countless people who have worked to help us. If you aren’t already, please follow us on <a href=\"https://www.facebook.com/justice4juliusjones/\" rel=\"nofollow\">Facebook</a>, <a href=\"https://twitter.com/justice4julius\" rel=\"nofollow\">Twitter</a> and <a href=\"https://www.instagram.com/justiceforjulius/\" rel=\"nofollow\">Instagram</a> and share our content. Also – if you’re on Facebook and looking to show you’re support, you can update your profile picture to include a “Justice for Julius” frame or, if you are in Oklahoma, an “Oklahomans for Julius” frame. Just click on “update” where your profile picture is and then “add frame” – then search for “Justice for Julius.”</p>\n<p>Finally, please be sure to <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">email the Pardon and Parole Board</a> to let them know you support commuting Julius’ sentence. You can do it easily and quickly through our website, by <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">clicking here</a>. The time you take to do this could literally help save Julius’ life.</p>\n<p>Thank you for your thoughts, prayers, advocacy and activism as we work to save an innocent man from Oklahoma’s death chamber.</p>\n<p>Sincerely,</p>\n<p>Cece Jones-Davis</p>", "photo": {"id": "224457412", "petitionMedium": {"url": "//assets.change.org/photos/2/sf/mz/aASfMzfSOnKBjbI-800x450-noPad.jpg?1597684545", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27491111", "createdAt": "2020-08-10T18:09:44.000Z", "title": "TIME for Justice", "description": "<p>Thank you for your interest in saving the life of Julius Jones, an innocent man on death row in Oklahoma. </p>\n<p>What started as a few men and women in Oklahoma, determined to shed light on Julius’ case, has now blossomed into a national movement. Today we have over 6 million signatures on Change.org supporting Julius. Over 71,000 letters have been sent to Oklahoma’s Pardon and Parole Board asking for Julius’ commutation (if you haven’t sent a letter yet, please <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">click here to do so</a>). The influential news show “20/20” aired a two-hour special documenting the incompetence, prosecutorial misconduct, and racism that defined Julius’ trial. And people all across the country – from Kim Kardashian-West to Russell Westbrook to everyday folks like you and me are talking about Julius Jones and what we can do to bring him home to his family.</p>\n<p>Those conversations are having an impact. We now believe Julius Jones WILL be given a commutation hearing later this year. Between now and then, we have a lot of work to do. In the coming weeks, we will be sending out updates with news on Julius and his case, “Fact vs. Fiction” memos to set the record straight, and other content you can share and pass on to your friends and family.</p>\n<p>We are excited that our first such update is a piece of great news. Dallas Cowboys Quarterback Dak Prescott has weighed in with an emotional, heartfelt letter to Gov. Kevin Stitt asking him to commute Julius’ sentence, and <a href=\"https://time.com/5875257/dak-prescott-dallas-cowboys-julius-jones/\" rel=\"nofollow\">TIME.com</a> has written a <a href=\"https://time.com/5875257/dak-prescott-dallas-cowboys-julius-jones/\" rel=\"nofollow\">great piece</a> on Dak’s involvement.</p>\n<p>You can read Dak’s full letter below, and please be sure to share the TIME article (<a href=\"https://time.com/5875257/dak-prescott-dallas-cowboys-julius-jones/\" rel=\"nofollow\">https://time.com/5875257/dak-prescott-dallas-cowboys-julius-jones/</a>  on your social media channels and with friends and family.</p>\n<p><em>Dear Governor Stitt and Oklahoma Pardon and Parole Board Members,</em></p>\n<p><em>I am writing to express my wholehearted support of Julius Jones’ commutation application.</em></p>\n<p><em>As a black man in this country right now, I experience injustices firsthand day in and day out, even as an athlete with “celebrity status.” Current events are shining a much-needed light on deep-seated prejudices and systemic mistreatment of black people, and it is my sincere hope that the cultural movements of today will lead to significant social changes that will create a better tomorrow. To that end, you all are in the unique position of being able to make a direct impact by addressing a specific miscarriage of justice.</em></p>\n<p><em>After reviewing the facts of the Julius Jones case, I firmly believe the wrong person is being punished for this terrible crime; furthermore, an evaluation of the process that led to Mr. Jones’ conviction raises serious legal and ethical concerns. I implore you to right this wrong. Please don’t let another innocent black man die from the systemic mistreatment that has plagued our nation for far too long.</em></p>\n<p><em>It is my firm belief that Julius Jones’ conviction and death sentence is an egregious injustice. Mr. Jones has been on death row for 20 years, despite written affidavits from his trial lawyers describing the ways they failed him in court. Mr. Jones’ attorneys never presented the photo taken 9 days prior to the crime that could have provided clarity about the shooter’s description. They were appointed without having any experience in death penalty cases, and did not even present Mr. Jones’ alibi at trial. In addition, a member of the jury (comprised of 11 white members out of 12) has confirmed that the jury acted with racial animus – admitting that inappropriate and biased statements were made by other jurors during the trial, including the use of racial slurs.</em></p>\n<p><em>The treatment of Julius Jones is the kind of miscarriage of justice African American men like myself live in fear of, and that is why I feel compelled to use the influence that God has blessed me with to speak up for what I believe is right and to give a voice to those who cannot speak for themselves. Julius Jones’ case is a clear example of what can happen to a person who cannot afford legal representation, and what can happen to a black person at any time in this country – which is exactly why so many are protesting for the changes we so desperately need. I ask for you to please do your part to help bring about this change by giving thoughtful and sincere consideration to your review of Julius Jones’ commutation application. My prayer is that he is able to salvage what remains of his life and that, through the righting of a decades-old wrong, he will be restored to his family soon.</em></p>\n<p><em>Sincerely,</em></p>\n<p><em>Rayne Dakota “Dak” Prescott</em><br><em>Dallas Cowboys</em></p>", "photo": {"id": "224421022", "petitionMedium": {"url": "//assets.change.org/photos/9/ad/wb/ybaDwbSpmTeenYL-800x450-noPad.jpg?1597082985", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "27366255", "createdAt": "2020-07-24T00:40:59.000Z", "signatureCount": 6000000}, {"__typename": "StarterPetitionUpdate", "id": "27288293", "createdAt": "2020-07-14T22:20:59.000Z", "title": "TONIGHT: Watch Julius Jones' Story on 20/20 (7pmCT/8pmET)", "description": "<p>Hi Everyone!</p>\n<p>Be sure to watch abc's 20/20 today for a special episode featuring the story of Julius Jones! 7pmCT/8pmET.</p>\n<p>Thanks!</p>\n<p>Cece</p>\n<p> </p>\n<p>More Info:</p>\n<p>A SPECIAL EDITION OF ‘20/20’ FEATURES FORMER HIGH SCHOOL BASKETBALL STATE CHAMPION AND STAR FOOTBALL PLAYER JULIUS JONES, WHO IS SEEKING CLEMENCY WHILE ON DEATH ROW FOR MURDER   </p>\n<p>‘The Last Defense: Julius Jones – A Special Edition of 20/20’ Airs Tuesday, </p>\n<p>July 14 (8:00 – 10:00 p.m. EDT), on ABC</p>\n<p> </p>\n<p>In 1999, authorities arrested 19-year-old former high school basketball state champion and star football player Julius Jones, days after a businessman in a predominantly white suburb of Oklahoma City was shot and killed. Prior to the murder, Jones was a student at the University of Oklahoma on a partial academic scholarship with dreams of joining the basketball team.Now, 21 years later, a two-hour “20/20” reports on the crime, trial and a key piece of evidence that authorities recently tested for DNA. The program features an interview with Jones from death row, who tells his version of events, claiming that he is innocent, and his lawyers’ claims that systemic racism influenced his conviction. “20/20” also reports on the celebrities, including Kim Kardashian West and NBA players Russell Westbrook, Trae Young and Blake Griffin, who support Jones’ quest for clemency. “The Last Defense: Julius Jones – A Special Edition of 20/20” airs Tuesday, July 14 (8:00 – 10:00 p.m. EDT), on ABC. </p>\n<p>The two-hour “20/20” on Julius Jones is an abridged version of Viola Davis’ and Julius Tennon’s documentary series, “The Last Defense.” </p>\n<p> </p>\n<p>“The Last Defense” is executive produced by Viola Davis, Julius Tennon and Andrew Wang for JuVee Productions; Christine Connor for XCON Productions; Vanessa Potkin and Aida Leisenring for Lincoln Square Productions; and Lee Beckett for ABC News Longform.</p>\n<p> </p>\n<p> </p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27271405", "createdAt": "2020-07-13T00:17:55.000Z", "title": "#justiceforjulius DJ Set Happening NOW on IG Live!", "description": "<p>Join @scottbudnick1 and the Julius Jones' family on Instagram live NOW in honor of the #justiceforjulius campaign!</p>", "photo": {"id": "224264448", "petitionMedium": {"url": "//assets.change.org/photos/7/un/yl/MFuNyLbxaWIimuc-800x450-noPad.jpg?1594599478", "processing": false}}, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "27243362", "createdAt": "2020-07-09T16:28:40.000Z", "title": "#justiceforjulius town hall + DJ set", "description": "<p>This month marks 21 years that Julius Jones has been on Oklahoma's death row, despite serious concerns regarding his conviction. <br>We are grateful for all of the support you have shown and how much the Justice for Julius community has grown. Oklahoma's Attorney General has taken notice and has said that Julius can file for clemency but also made some questionable statements this week.  Oklahoma plans to resume executions soon, and Julius is out of appeals as he waits to hear from the Pardon and Parole Board.</p>\n<p>Join us TODAY, July 9th at 7:00 PM Central for a Town Hall featuring key players who will talk about the case live on the #justiceforjulius <a href=\"https://www.facebook.com/justice4juliusjones/\" rel=\"nofollow\">Facebook</a> page.  We will separate fact from fiction and take questions from the community. </p>\n<p>ADDITIONALLY, join our friend Scott Budnick (producer of 'Just Mercy' and the 'Hangover' movies)  on <strong>Sunday, July 12th</strong> for a special DJ set honoring the fight for Julius' life and to uplift his family members on IG LIVE @scottbudnick1</p>\n<p> <br>Thank you for your support!</p>\n<p>~Cece</p>\n<p> </p>\n<p> </p>", "photo": {"id": "224243824", "petitionMedium": {"url": "//assets.change.org/photos/0/jy/mz/CIJYMZILBfXQjdg-800x450-noPad.jpg?1594312123", "processing": false}}, "video": null, "embeddedMedia": null}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjQ3", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13534925", "slug": "julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma", "user": {"id": "898371250", "displayName": "Cece Jones-Davis #FreeJuliusJones", "photo": {"id": "223801661", "userSmall": {"url": "//assets.change.org/photos/2/cp/fd/YIcPfDVlWUSGPdg-48x48-noPad.jpg?1589988094", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "StarterPetitionUpdate", "id": "26992703", "createdAt": "2020-06-15T14:13:50.000Z", "title": "Join the #justiceforjulius challenge TODAY!", "description": "<p>Thanks to all of you, leaders in Oklahoma are paying attention to our demand for Julius Jones to receive a hearing before the pardon and parole board! More influencers have also heard of Julius' plight and are coming along to help him. He and his family are so grateful for every one of you, but we can't stop now! </p>\n<p>Will you join the #justiceforjulius challenge?</p>\n<p>Here's how:</p>\n<p>1) download a graphic <a href=\"https://www.justiceforjuliusjones.com/justiceforjulius-toolkit\" rel=\"nofollow\">here</a> </p>\n<p>2) Post to Instagram, Facebook, and/or Twitter, while sharing WHY you support the #justiceforjulius campaign</p>\n<p>3) TAG @justiceforjulius (IG/FB) and @justice4julius; use the #justiceforjulius hashtag</p>\n<p>Can't wait to see and share your posts! Thank you for to standing with Julius Jones, especially during these unprecedented times. </p>\n<p>Sincerely,</p>\n<p>Cece</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "MilestonePetitionUpdate", "id": "26795853", "createdAt": "2020-06-02T06:51:08.000Z", "signatureCount": 1500000}, {"__typename": "MilestonePetitionUpdate", "id": "26781308", "createdAt": "2020-06-01T01:02:37.000Z", "signatureCount": 1000000}, {"__typename": "MilestonePetitionUpdate", "id": "26765916", "createdAt": "2020-05-30T12:12:15.000Z", "signatureCount": 750000}, {"__typename": "MilestonePetitionUpdate", "id": "26750958", "createdAt": "2020-05-28T21:44:03.000Z", "signatureCount": 500000}, {"__typename": "MilestonePetitionUpdate", "id": "26747968", "createdAt": "2020-05-28T15:59:11.000Z", "signatureCount": 400000}, {"__typename": "MilestonePetitionUpdate", "id": "26743548", "createdAt": "2020-05-28T04:45:17.000Z", "signatureCount": 300000}, {"__typename": "StarterPetitionUpdate", "id": "26684983", "createdAt": "2020-05-20T15:28:29.000Z", "title": "Julius Jones' Story Featured on the Wrongful Conviction Podcast", "description": "<p>Momentum has been growing around #justiceforjulius for quite a while now, and all of you who have signed the petition have been a big part of that!  Please listen to this compelling podcast with Kim Kardashian, Jason Flom, Attorney Dale Baich, and Julius' family. Please share!</p>\n<p>As always, thank you for your support!</p>\n<p>~Cece</p>", "photo": null, "video": null, "embeddedMedia": {"providerName": "Apple Podcasts", "photoUrl": "https://is3-ssl.mzstatic.com/image/thumb/Podcasts113/v4/7b/8f/4e/7b8f4e6d-5ebc-14f8-fff5-0b376dc4414f/mza_9420895498709698736.jpg/1200x630wp.png", "description": "‎S11E1: Julius Jones - In the fall of 1998, Julius Jones had the whole world ahead of him. He was a freshman who planned to study engineering and was attending the University of Oklahoma on an academic scholarship. The following summer, just three days after his 19th birthday, Julius was awakened and..."}}, {"__typename": "MilestonePetitionUpdate", "id": "26588304", "createdAt": "2020-05-08T21:30:31.000Z", "signatureCount": 200000}, {"__typename": "MilestonePetitionUpdate", "id": "25496239", "createdAt": "2019-12-17T04:28:11.000Z", "signatureCount": 150000}, {"__typename": "StarterPetitionUpdate", "id": "25472500", "createdAt": "2019-12-11T12:49:38.000Z", "title": "It's TODAY! National Julius Jones Petition Day- Please Help Us", "description": "<p>Thanks again for doing your part in signing Julius' petition. We will be delivering it the the members of the Oklahoma Pardon and Parole Board and to the governor of our state soon.  Because of that, we need as many signatures as possible.</p>\n<p>Please consider 'sharing' <a href=\"http://chng.it/Rv9RWJdY\" rel=\"nofollow\">this petition</a> on your social media today, and visiting <a href=\"http://www.justiceforjulius.com\" rel=\"nofollow\">www.justiceforjulius.com</a> to also send an <a href=\"https://oneclickpolitics.global.ssl.fastly.net/messages/edit?promo_id=7177\" rel=\"nofollow\">e-letter</a> to the Pardon and Parole Board and Governor Stitt. You can buy a #justiceforjulius <a href=\"https://www.bonfire.com/justice-for-julius-jones/\" rel=\"nofollow\">t-shirt</a> there, too (all funds go directly to bonfire for the make and delivery of your shirt. We don't profit!).</p>\n<p>Thank you so much for standing with #justiceforjulius,</p>\n<p>Cece</p>", "photo": null, "video": null, "embeddedMedia": null}, {"__typename": "StarterPetitionUpdate", "id": "25451626", "createdAt": "2019-12-06T11:53:51.000Z", "title": "Thank you for supporting Julius + National Julius Jones Petition Day!", "description": "<p>I cannot tell you how much your support means to those of us here in Oklahoma who are fighting for Julius. Your presence makes us feel stronger and less alone! THANK YOU.</p>\n<p>We think of you, and all those who take the time to sign and share this petition, as <strong>#justiceforjulius ambassadors!</strong> Please, please stay with us. <strong>Wednesday, Dec. 11th</strong> will be <strong>National Julius Jones Petition Day</strong>, and we are asking that you <em>share the petition (again) and the attached graphic on social media, </em>telling your audience why you support #justiceforjulius. Please tag us! Also, subscribe to our email list at <strong><a href=\"http://www.justiceforjulius.com\" rel=\"nofollow\">www.justiceforjulius.com</a></strong> to stay connected to this work. #justiceforjulius will require all of us. </p>\n<p>Thank you again!</p>\n<p>Cece Jones-Davis (The Julius Jones Coalition, Oklahoma)</p>\n<p><strong>Twitter: @justice4julius</strong><br><strong>FB/IG: @justiceforjulius </strong></p>", "photo": {"id": "222844747", "petitionMedium": {"url": "//assets.change.org/photos/4/ks/zm/vtksZmTxLqVOpLb-800x450-noPad.jpg?1575633233", "processing": false}}, "video": null, "embeddedMedia": null}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjU5", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13534925", "slug": "julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma", "user": {"id": "898371250", "displayName": "Cece Jones-Davis #FreeJuliusJones", "photo": {"id": "223801661", "userSmall": {"url": "//assets.change.org/photos/2/cp/fd/YIcPfDVlWUSGPdg-48x48-noPad.jpg?1589988094", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "25450098", "createdAt": "2019-12-06T02:04:39.000Z", "signatureCount": 100000}, {"__typename": "MilestonePetitionUpdate", "id": "25447478", "createdAt": "2019-12-05T15:07:49.000Z", "signatureCount": 75000}, {"__typename": "MilestonePetitionUpdate", "id": "25429476", "createdAt": "2019-12-01T23:54:08.000Z", "signatureCount": 50000}, {"__typename": "MilestonePetitionUpdate", "id": "25174190", "createdAt": "2019-10-09T16:50:05.000Z", "signatureCount": 40000}, {"__typename": "MilestonePetitionUpdate", "id": "24765776", "createdAt": "2019-06-29T17:37:56.000Z", "signatureCount": 35000}, {"__typename": "MilestonePetitionUpdate", "id": "24685092", "createdAt": "2019-06-11T15:01:54.000Z", "signatureCount": 30000}, {"__typename": "MilestonePetitionUpdate", "id": "24660867", "createdAt": "2019-06-05T21:15:37.000Z", "signatureCount": 25000}, {"__typename": "MilestonePetitionUpdate", "id": "24442858", "createdAt": "2019-04-18T14:08:08.000Z", "signatureCount": 20000}, {"__typename": "MilestonePetitionUpdate", "id": "24408221", "createdAt": "2019-04-10T11:49:34.000Z", "signatureCount": 17500}, {"__typename": "MilestonePetitionUpdate", "id": "24105744", "createdAt": "2019-02-01T00:54:33.000Z", "signatureCount": 15000}, {"__typename": "MilestonePetitionUpdate", "id": "23757005", "createdAt": "2018-12-13T18:42:11.000Z", "signatureCount": 12500}, {"__typename": "MilestonePetitionUpdate", "id": "23698161", "createdAt": "2018-12-01T21:51:11.000Z", "signatureCount": 10000}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjcx", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13534925", "slug": "julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma", "user": {"id": "898371250", "displayName": "Cece Jones-Davis #FreeJuliusJones", "photo": {"id": "223801661", "userSmall": {"url": "//assets.change.org/photos/2/cp/fd/YIcPfDVlWUSGPdg-48x48-noPad.jpg?1589988094", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "23665683", "createdAt": "2018-11-25T14:08:03.000Z", "signatureCount": 9000}, {"__typename": "MilestonePetitionUpdate", "id": "23621938", "createdAt": "2018-11-16T16:37:22.000Z", "signatureCount": 8000}, {"__typename": "MilestonePetitionUpdate", "id": "23603957", "createdAt": "2018-11-14T00:56:43.000Z", "signatureCount": 7500}, {"__typename": "MilestonePetitionUpdate", "id": "23584258", "createdAt": "2018-11-11T15:21:42.000Z", "signatureCount": 7000}, {"__typename": "MilestonePetitionUpdate", "id": "23556719", "createdAt": "2018-11-07T16:12:45.000Z", "signatureCount": 6000}, {"__typename": "MilestonePetitionUpdate", "id": "23540097", "createdAt": "2018-11-04T17:58:02.000Z", "signatureCount": 5000}, {"__typename": "MilestonePetitionUpdate", "id": "23532482", "createdAt": "2018-11-03T16:31:24.000Z", "signatureCount": 4000}, {"__typename": "MilestonePetitionUpdate", "id": "23511198", "createdAt": "2018-10-30T16:28:09.000Z", "signatureCount": 3000}, {"__typename": "MilestonePetitionUpdate", "id": "23503652", "createdAt": "2018-10-29T15:11:41.000Z", "signatureCount": 2500}, {"__typename": "MilestonePetitionUpdate", "id": "23501687", "createdAt": "2018-10-29T04:12:38.000Z", "signatureCount": 2000}, {"__typename": "MilestonePetitionUpdate", "id": "23501353", "createdAt": "2018-10-29T02:11:09.000Z", "signatureCount": 1500}, {"__typename": "MilestonePetitionUpdate", "id": "23445887", "createdAt": "2018-10-19T15:15:24.000Z", "signatureCount": 1000}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjgz", "hasNextPage": true}}}}}, {"data": {"petition": {"id": "13534925", "slug": "julius-jones-is-innocent-don-t-let-him-be-executed-by-the-state-of-oklahoma", "user": {"id": "898371250", "displayName": "Cece Jones-Davis #FreeJuliusJones", "photo": {"id": "223801661", "userSmall": {"url": "//assets.change.org/photos/2/cp/fd/YIcPfDVlWUSGPdg-48x48-noPad.jpg?1589988094", "processing": false}}}, "organization": null, "updatesConnection": {"nodes": [{"__typename": "MilestonePetitionUpdate", "id": "23389659", "createdAt": "2018-10-09T00:17:14.000Z", "signatureCount": 750}, {"__typename": "MilestonePetitionUpdate", "id": "23323198", "createdAt": "2018-09-25T23:10:39.000Z", "signatureCount": 500}, {"__typename": "MilestonePetitionUpdate", "id": "23305224", "createdAt": "2018-09-22T02:47:07.000Z", "signatureCount": 250}, {"__typename": "MilestonePetitionUpdate", "id": "23302735", "createdAt": "2018-09-21T13:59:42.000Z", "signatureCount": 200}, {"__typename": "MilestonePetitionUpdate", "id": "23297097", "createdAt": "2018-09-20T11:25:01.000Z", "signatureCount": 100}, {"__typename": "MilestonePetitionUpdate", "id": "23295875", "createdAt": "2018-09-20T03:12:39.000Z", "signatureCount": 50}, {"__typename": "MilestonePetitionUpdate", "id": "23295762", "createdAt": "2018-09-20T02:24:11.000Z", "signatureCount": 25}, {"__typename": "MilestonePetitionUpdate", "id": "23295700", "createdAt": "2018-09-20T02:00:04.000Z", "signatureCount": 10}, {"__typename": "MilestonePetitionUpdate", "id": "23295686", "createdAt": "2018-09-20T01:55:47.000Z", "signatureCount": 5}], "pageInfo": {"endCursor": "YXJyYXljb25uZWN0aW9uOjky", "hasNextPage": false}}}}}], "count": 8, "cursors": ["", "YXJyYXljb25uZWN0aW9uOjEx", "YXJyYXljb25uZWN0aW9uOjIz", "YXJyYXljb25uZWN0aW9uOjM1", "YXJyYXljb25uZWN0aW9uOjQ3", "YXJyYXljb25uZWN0aW9uOjU5", "YXJyYXljb25uZWN0aW9uOjcx", "YXJyYXljb25uZWN0aW9uOjgz"]}